{"authors": ["Colin Reed", "Colin Reed Is A Former Campaign Manager For Massachusetts Scott Brown", "A Republican Strategist."], "date_download": "2020-05-12 01:49:12", "date_modify": "2020-05-12 01:49:12", "date_publish": "2020-04-15 23:34:11", "description": "Right now it’s difficult to imagine November’s election being a referendum on anything other than the current coronavirus pandemic and our government’s response to it.", "filename": "opinion_colin-reed-coronavirus-gives-trump-a-bully-pulpit-will-it-help-or-hurt-his-reelection-hopes_1589248152.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2020/04/Biden-Trump-Split-thumb.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_colin-reed-coronavirus-gives-trump-a-bully-pulpit-will-it-help-or-hurt-his-reelection-hopes_1589248152.html", "title": "Colin Reed: Coronavirus gives Trump a bully pulpit - will it help or hurt his reelection hopes?", "title_page": "Colin Reed: Coronavirus gives Trump a bully pulpit – will it help or hurt his reelection hopes? | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\nRight now it’s difficult to imagine November’s election being a referendum on anything other than the current coronavirus pandemic and our government’s response to it.\nThe other breathless flashpoints of the Trump presidency – impeachment, tweets, Russia – have fallen by the wayside. When voters can’t leave their homes without fear of contracting a deadly disease that has no cure or a vaccine, nothing else really matters.\nFew could disagree with President Trump’s statement that deciding when to reopen the economy would be the “toughest” of his presidency.\nOBAMA POISED TO HELP TURBOCHARGE BIDEN'S FUNDRAISING\nIn the meantime, if the president were to meet the moment and lead the country out of the coronavirus nightmare, there is a chance the swing and independent voters who took a flier on him in 2016 before abandoning him two years later might give him a second look.\nTo do so requires measured and steady leadership by the president – reassuring Americans that both health and economic concerns are being treated equally.\nIt requires not firing Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases. The bespectacled immunologist has become a widely respected household name, earning the approval of 78 percent of Americans in a recent poll.\nTypically, partisan politics take a backseat during periods of crisis. But these are not normal times. We live in a hyper-partisan climate, and everything happening right now is playing out underneath the shadow of a presidential election creeping ever closer.\nPresidential elections are binary choices, and it’s not as though former Vice President Joe Biden is setting the world on fire.\nStuck in his home, Biden has been overshadowed by the daily briefings from big-name governors such as New York’s Andrew Cuomo or California’s Gavin Newsom. Until this week when he began rolling out the endorsements of party bigwigs, Biden has struggled to get news oxygen.\nYes, the official blessing from his one-time primary foes (Sens. Elizabeth Warren of Massachusetts and Bernie Sanders of Vermont) and his former governing partner (President Barack Obama) are short-term shots in the arm for Biden.\nBy projecting a sense of unity with a rapid consolidation of support for Biden, Democrats are showing they are serious about not falling into the trap of 2016 when the party was slow to unify around Hillary Clinton.\nBut it only really matters if rank-and-file Democratic voters follow suit. It’s still an open question if the younger, liberal and restless members of the party get on board with a 77-year-old politician who has been in Washington since Watergate.\nNow the attention shifts toward the next major inflection point for Biden: the veepstakes. Neither Cuomo nor Newsom are eligible for the job, given Biden’s ironclad promise to bring gender diversity to the ticket.\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\nOne of the Democratic Party’s bright stars, Michigan Gov. Gretchen Whitmer, suddenly finds herself engulfed in controversy after thousands of protesters demonstrated Wednesday in the state capital of Lansing against her stay-at-home orders.\nBut no amount of vice presidential speculation can compete with President Trump’s bully pulpit. During a crisis, a politician without a bully pulpit is like a fire without oxygen: neither can go very far. Without an official government post, Biden has no natural platform. There is only so much he can say without looking gimmicky or political.\nAs Biden has acknowledged, “you can’t compete with a president\" because \"that’s the ultimate bully pulpit.” It would be a challenge for an extremely talented politician to maneuver in this climate, let alone Biden.\nEven Biden’s strongest supporters, if they’re being honest, would acknowledge he’s lost some speed off his fastball.\nCLICK HERE TO GET THE FOX NEWS APP\nIt’s the same dilemma Republican Mitt Romney faced during the closing days of the 2012 presidential race when Superstorm Sandy destroyed large swaths of the Eastern Seaboard. There’s only so much a political challenger can do when politics are far from voters’ minds.\nThe old cliché that good policy equals good politics rings true now more than ever. It’s a lesson President Trump would be wise to heed.\nCLICK HERE TO READ MORE BY COLIN REED", "url": "https://www.foxnews.com/opinion/colin-reed-coronavirus-gives-trump-a-bully-pulpit-will-it-help-or-hurt-his-reelection-hopes"}