{"authors": ["Amesh Adalja"], "date_download": "2020-05-12 04:00:25", "date_modify": "2020-05-12 04:00:25", "date_publish": "2020-01-27 11:18:04", "description": "While case counts are expected to rise and new cases are continually being discovered worldwide, important scientific questions have arisen - chief among these is the idea that individuals infected with the virus are capable of spreading it before symptoms appear.", "filename": "opinion_coronavirus-addressing-the-potential-of-pre-symptomatic-spread-dr-amesh-adalja_1589256025.html", "image_url": "https://media2.foxnews.com/BrightCove/694940094001/2020/01/27/694940094001_6126880425001_6126879218001-vs.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_coronavirus-addressing-the-potential-of-pre-symptomatic-spread-dr-amesh-adalja_1589256025.html", "title": "Dr. Amesh Adalja: Coronavirus - addressing the potential of pre-symptomatic spread", "title_page": "Dr. Amesh Adalja: Coronavirus - addressing the potential of pre-symptomatic spread | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "As the novel coronavirus outbreak continues to evolve and changes minute-by-minute, there is one important development that bears watching. While case counts are expected to rise (currently at almost 3000 with 81 deaths) and new cases are continually being discovered worldwide related to travel to Wuhan and other impacted parts of China, important scientific questions have arisen that have may play a major role in how this outbreak grows and can be controlled. Chief among these questions is the idea that individuals infected with the virus are capable of spreading it before symptoms appear.\nThere is at least one report of pre-symptomatic spread that occurred in China. In this case, a traveler to Guangzhou apparently infected others and only developed symptoms two days later. While it may seem like a technical detail, to those following the outbreak, this is a serious matter. In many contagious infectious diseases, a person is not infectious to others until symptoms appear. This time lag, known as an incubation period, allows public health authorities to intervene and monitor those exposed and isolate them if and when they develop symptoms. However, in an infection in which contagiousness occurs prior to symptoms, such as with influenza, it is a much more challenging task as those carriers may have many contacts before symptoms occur. This parameter is a major factor in the difficulty level of controlling an infectious disease outbreak.\nEven if this is proved to be the case with the novel coronavirus, it is important to remember that this type of contagiousness would be expected to occur in the latter part of the incubation period, not its entirety (which has not been fully established and may range from a few days to 14). For example, influenza may become contagious one day prior to symptom onset. Regardless, confirming the reality of this mode of transmission is critical.\nVIRGINIA INVESTIGATES 3 POSSIBLE CORONAVIRUS CASES: HEALTH OFFICIALS\nWhen it comes to the six other human coronaviruses, however, there has not been any prior knowledge of this pre-symptomatic spread. In fact, the lack of this type of transmission is credited with facilitating the control of SARS. As the Centers for Disease Control and Prevention's Dr. Nancy Messonnier has stated, \"We don't have any clear evidence of patients being infectious before symptom onset.\" Thus, it is really crucial to understand what the circumstances were in the reported case.\nWere mild symptoms present to any degree in this individual? As is well known, the spread of influenza is one that is difficult to control as evidenced during the last pandemic in 2009. A key factor was the pre-symptomatic spread that had occurred prior to the knowledge of the novel 2009 H1N1 influenza virus. A significant aim of the outbreak is to quench it and thus prevent the novel coronavirus from establishing itself in the human population in a manner as influenza has.\nCLICK HERE TO GET THE FOX NEWS APP\nIn the United States, five cases have been diagnosed illustrating that the system in place to manage this virus is functioning. There has been no secondary transmission. We will, nonetheless, see more cases but the threat to the general public remains low. Additionally, there has been no sustained human-to-human spread outside China to date which is reassuring.\nHowever, despite the current lack of major societal risk in the U.S. with this outbreak, it is vital that policymakers in the U.S. and other nations prepared for a longer-term battle against this virus. We will need to think about accelerating vaccine development, testing antiviral compounds, scaling up diagnostic testing, and facilitating clinical trials among many other tasks. It has been 17 years since SARS appeared and nine years since MERS. The lack of progress on coronavirus countermeasures in that time period predictably left the world vulnerable to another coronavirus outbreak and it is time to take this threat off the table by giving it the attention it deserves.\nCLICK HERE TO READ MORE BY DRAMESH ADALJA", "url": "https://www.foxnews.com/opinion/coronavirus-addressing-the-potential-of-pre-symptomatic-spread-dr-amesh-adalja"}