{"authors": ["Colin Reed", "Colin Reed Is A Former Campaign Manager For Massachusetts Scott Brown", "A Republican Strategist."], "date_download": "2020-05-12 02:12:26", "date_modify": "2020-05-12 02:12:26", "date_publish": "2020-02-24 11:43:01", "description": "As this primary contest wears on, so too will the next stages of grief as Democrats learn to accept life under their new standard-bearer: Bernard Sanders.", "filename": "opinion_colin-reed-is-bernie-sanders-newfound-front-runner-status-pushing-establishment-dems-to-the-edge_1589249546.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/48d740cf-10ce-440e-b1b6-086895785ed5/5eefb6de-8a83-4d8d-8590-91ca0c6487f1/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_colin-reed-is-bernie-sanders-newfound-front-runner-status-pushing-establishment-dems-to-the-edge_1589249546.html", "title": "Colin Reed: Is Bernie Sanders’ newfound front-runner status pushing establishment Dems to the edge?", "title_page": "Colin Reed: Is Bernie Sanders’ newfound front-runner status pushing establishment Dems to the edge? | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "When looking at the current state of the Democratic primary, I am reminded of Elisabeth Kubler-Ross’s five stages of grief – denial, anger, bargaining, depression and acceptance – when it comes to the party’s takeover by Sen. Bernie Sanders, I-Vt., a man who has never identified as a Democrat. After all, as Sanders chalks up victories, it’s becoming impossible to deny his ever-increasing odds of becoming the nominee – let alone his status as the clear front-runner – and it appears the party is transitioning from denial to anger.\nThe “denial” argument by Sanders’ detractors went something like this: a nearly 80-year old socialist who honeymooned in the U.S.S.R. and praised Fidel Castro would never lead the party of John F. Kennedy or Barack Obama. His unabashed litany of left-wing policy prescriptions – vast redistributions of wealth, European-style health care and free college, to name a few – would raise electability doubts in the minds of voters desperate to oust President Trump. Sanders’ supposed “high floor and low ceiling” support was limited to white and younger voters. He had no appeal to the diverse voting blocs that make up important pillars of the Democratic coalition.\nThen voters started weighing in. After finishing near the top of the Iowa melee, winning New Hampshire cleanly and dominating Nevada – including among non-white voters – Sanders’ supporters answered each of the detractions.\nSANDERS UNSTOPPABLE? SENATOR RISES IN SOUTH CAROLINA, EYES VIRTUAL SWEEP OF EARLY 2020 CONTESTS\nNext comes the anger phase. Watch for a sudden and sharp uptick in negative narratives around Sanders to churn in the press and social media. There will be a new demand among investigative reporters and opposition researchers alike to inject fresh and damaging pieces of information about Sanders into the public domain.\nBernie has an extensive paper trail. He’s been in elected office – as an avowed socialist no less – since 1981 as mayor of Burlington, Vt. All that’s old will become new again: meeting minutes, budgets, audio and video transcripts, his written work, congressional votes, his wife Jane’s real estate transactions – all will be fair game.\nThe most damaging narrative to a campaign – left, right or center – is using an old stance, position or statement to contradict a current one. Nobody likes hypocrites or opportunistic candidates. It makes them sound like, well, politicians.\nThe challenge for those seeking to damage Sanders is he is, for the most part, nothing if not consistent. His views can be called extreme or outside the mainstream, but he articulates and defends them with passion. Bernie argues for bold colors, not pale pastels, to borrow a phrase from President Reagan.\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\nFor all the comparisons between Sanders in 2020 to Trump in 2016, watching how the Vermonter absorbs the inevitable barbs headed his way will be one of the most telling. It’s still unknown if attacks on Sanders will only strengthen his standing, as it did Trump four years ago. It’s easy to forget now, but the GOP establishment did put up some level of resistance when Trump started rolling. His past donations to Democrats, his inconsistent policy positions, inflammatory statements once considered career-killers to any normal politician – none of Trump’s dirty laundry mattered to his supporters.\nThey saw him as a change agent who would upset the apple cart and fight for the issues that mattered. Ditto for Sanders’ supporters.\nCLICK HERE TO GET THE FOX NEWS APP\nBut back to the five stages of grief. Assuming “anger” fades away, that brings us to “bargaining.” In some ways, former New York City Mayor Mike Bloomberg represents an early iteration of the bargain candidate. His message to voters – delivered in the form of nearly half a billion dollars worth of television ads – has been: you might not love me, but I can stop Trump. Earlier in the contest, former Vice President Joe Biden also tried a version of this message, albeit in the form of a shaky candidate who’s clearly lost a few mph off his fastball rather than Bloomberg’s focus-group-tested and slickly produced advertisements.\nMaybe either Bloomberg or Biden reverses their respective tailspins and emerges as the consensus candidate for voters uncomfortable with Bernie. To date, neither has demonstrated the political chops to do so. The odds are better that as this primary contest wears on, so too will the next stages of grief as Democrats learn to accept life under their new standard-bearer: Bernard Sanders.\nCLICK HERE TO READ MORE BY COLIN REED", "url": "https://www.foxnews.com/opinion/colin-reed-is-bernie-sanders-newfound-front-runner-status-pushing-establishment-dems-to-the-edge"}