{"authors": ["Mike Huckabee", "Mike Huckabee Was The Governor Of Arkansas", "A Republican Candidate For President. He Is Currently Host Of", "Huckabee", "On Tbn", "A Fox News Contributor."], "date_download": "2020-05-12 03:49:54", "date_modify": "2020-05-12 03:49:54", "date_publish": "2020-01-29 10:14:57", "description": "Liberals don’t really hate Donald Trump; they hate his supporters. President Trump just presents a more convenient target — most of the time.", "filename": "opinion_cnn-mocks-tens-of-millions-of-trump-voters-mike-huckabee_1589255394.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/cnn-lemon.png", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_cnn-mocks-tens-of-millions-of-trump-voters-mike-huckabee_1589255394.html", "title": "Mike Huckabee: CNN mocks tens of millions of Trump voters", "title_page": "Mike Huckabee: CNN mocks tens of millions of Trump voters | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Liberals don’t really hate Donald Trump; they hate his supporters. President Trump just presents a more convenient target — most of the time.\nThis weekend, never-Trump carnival barker Rick Wilson went on the least-watched of the big three cable news networks, CNN, to take another swing at the President’s supporters.\nWilson has gotten rich and — among a certain set — famous from this game, so he’s not afraid to push the boundaries. He’s called Trump voters neo-Nazis and worse, and he once told a Trump-supporting CNN guest he would “gut” him “like a fish.”\nDON LEMON ADDRESSES CNN PANEL MOCKING TRUMP VOTERS\nThis time, though he went even lower. Mocking the “credulous boomer rube demo that backs” President Trump, Wilson switched into a parody of a southern accent and started acting like a buffoon. Then fellow guest Wajahat Ali got in on the action, riffing with Wilson as the two portrayed dumb hicks who support the President because they hate “the elitists” with their “math and readin’” and “sippin’ lattes.”\nMake no mistake, that is exactly what Rick Wilson and Wajahat Ali think huge swaths of the country are like. CNN host Don Lemon literally buckled over in laughter as his guests continued their spiteful routine. When he was called out for engaging in that mean-spirited mockery, Lemon tried to claim that he “didn’t catch everything that was said.”\nLemon, who has launched into heartfelt on-air tirades over things as trivial the Trump Campaign tweeting an Avengers meme, eventually asked his guests to stop — not because he found it offensive, but because he needed a pause to laugh some more.\nLemon not only agrees with this assessment of the President’s millions of supporters but thinks it’s positively hilarious to denigrate and stereotype people he has obviously never bothered to interact with or understand.\nWhat upsets people like Wilson, Ali, and Lemon so much about President Trump is that he represents, in their minds, “credulous boomer rubes” having political power — political power they believe rightfully belongs to people like them.\nWilson spent 30 years in Republican politics trying to make sure the “rubes” who make up the base of his putative party wielded as little political influence as possible. Wilson’s political philosophy derives essentially from the belief that his degree from George Washington University and his ties to politicians like former President George H.W. Bush elevate him from the “credulous rubes” of Middle America into the cadre of people who deserve a say in how their country is run.\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\nAli, unlike Wilson, has always been a man of the left — but contempt for the rubes in flyover country is every bit as central to his understanding of American politics. His career has been devoted in large part to promoting the idea that American conservatives became beholden to an “Islamophobia network” in the years after 9/11.\nDon Lemon, meanwhile, has been caricaturing Trump supporters on CNN for years, smearing them as racists at every opportunity — even at a presidential debate. His arrogance is matched only by his ignorance.\nCLICK HERE TO GET THE FOX NEWS APP\nThe America first movement is an existential threat to people like Don Lemon, exposing their essential mediocrity and the precariousness of their “elite” status. We saw that Tuesday night in Wildwood, New Jersey. The tens of thousands of Trump supporters who descended on the Jersey Shore weren’t the gap-toothed yokels of liberals’ imaginations, but hard-working men and women from every segment of society. They were union workers and bankers; single mothers and families; students and tradesmen; young and old; black, white, Asian, and Hispanic; Democrats, Republicans, and independents.\nFor the establishment elitists of both parties, President Donald J. Trump represents their worst fear: the American people voting for their own interests.\nCLICK HERE TO READ MORE FROM MIKE HUCKABEE", "url": "https://www.foxnews.com/opinion/cnn-mocks-tens-of-millions-of-trump-voters-mike-huckabee"}