{"authors": ["Helgi Walker"], "date_download": "2020-05-12 03:06:36", "date_modify": "2020-05-12 03:06:36", "date_publish": "2020-02-04 16:30:52", "description": "A powerful new documentary gives us all the opportunity to hear directly from Justice Thomas in his own words.", "filename": "opinion_clarence-thomas-legacy-admire-helgi-walker_1589252796.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/f8f6d104-9139-4a7a-853e-be0ad769e353/4f537884-fd1f-4246-ac66-1f12b9930732/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_clarence-thomas-legacy-admire-helgi-walker_1589252796.html", "title": "Helgi Walker: Clarence Thomas' legacy is one all Americans should admire", "title_page": "Helgi Walker: Clarence Thomas' legacy is one all Americans should admire | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "I clerked for Supreme Court Justice Clarence Thomas 25 years ago. To millions of people across America he is a heroic figure, just as he is to me. But I am sometimes approached by people who have never read a Supreme Court decision, much less met the justice, but nonetheless have something negative to say about him.\nSo how do I respond? I explain that he is widely considered one of the most influential legal thinkers of his time by lawyers, academics, and historians, whether they agree with him or not. And I say, “If you ever had a chance to meet and talk with the justice, you would love and admire him as a human being as much as I do.”\nNow every American has that chance. A powerful new documentary, \"Created Equal: Clarence Thomas in His Own Words,\" directed by Michael Pack, gives us all the opportunity to hear directly from Justice Thomas in his own words.\nJUSTICE CLARENCE THOMAS: JOE BIDEN HAD 'NO IDEA' WHAT HE WAS TALKING ABOUT AT CONFIRMATION HEARINGS\nIn the film, he speaks into the camera, direct and unfiltered. Watching this movie is like sitting down and having a long conversation with him about his life, faith, family, and values.\nAnd what a wonderful conversation it is. Everybody should see it — the many for whom he is already an American hero, and those who think they know him based on mainstream media depictions.\nIt’s not designed as a movie for a legal audience (thank goodness it’s not for the lawyers!). It’s a powerful biography, from a human perspective, about a very special man’s life, and what he achieved in this great country of ours through grit, commitment to principle, and personal bravery.\nA Washington Post writer called it \"a marvel of filmmaking that two hours pass so quickly. At the end of a screening I recently attended, there weren't many dry eyes in the room. The film ... is a mesmerizing and deeply moving account of Thomas's journey from a no-plumbing shack in Georgia's Lowcountry to the highest court in the land.\" Another critic called it “undeniably compelling.”\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\nIn the movie, we learn about Thomas’ upbringing and how those experiences shaped his journey to the Supreme Court. He talks about growing up in the segregated South in the 1940s and 50s, starting out as a child in a one-room shack in the rural poverty of Pin Point, Georgia and ultimately being raised by his grandparents in a modest house in nearby Savannah that seemed a paradise to him with its running water and a real kitchen.\nHe talks of being six-years-old and wandering the streets by himself, hungry. He tells us about why he was determined to go into the legal field: His grandfather was pulled over by the police for wearing too many clothes, yet had no way to defend himself in society.\nHe talks about the nuns at his Catholic high school, who, despite the existing segregation, “were on our side from day one.” The kindness they showed him changed his life. As he explains, “You knew they loved you. And ... when you think somebody loves you and deeply cares about your interests, somehow, they can get you to do hard things.\" And so they did, encouraging him to excel academically, which he did.\nRacism was a daily and hurtful reality. He describes how this discrimination motivated him to be an over-achiever in school, saying, \"So I can't get a 98 ... I have to have 100. In other words, to leave them nothing but race. It's sort of like ‘checkmate.’”\nIn the 1960s, the assassination of Martin Luther King threw Thomas into dark despair about the state of race relations in America. He says he became \"an angry black man.\" He shares about the night he prayed to God to take the hate out of his heart and found a way to embrace love, faith and hard work as his guiding values -- the values his grandfather originally taught him.\nHis commitment to these beliefs allowed Thomas to withstand a brutal Supreme Court confirmation hearing. True to form, he cared more about defending his honor than the job itself.\nEven when pushed to withdraw his name from consideration, he would not retreat, saying, \"I'd rather die than withdraw.\" The film showcases his strength under fire and his unbreakable belief that personal integrity matters more than anything.\nAfter donning the robes of a Supreme Court justice, Thomas reshaped modern jurisprudence to reflect the original intent of the Founding Fathers by relying on the text of the Constitution. Thomas is not swayed by temporary expediency but is guided by the enduring values of our founding documents, such as the Declaration of Independence and its world-changing idea that “All men are created equal.” As he explains in the movie, those values are the key to our constitutional democracy.\nOver the decades, Thomas has written forceful and widely-acclaimed opinions protecting free speech, religious freedom, and personal liberty against the administrative state. He has authored more than 600 opinions, 30 percent more than any other sitting justice.\nThese opinions display a willingness to delve deeply into the history of the Constitution and its meaning and to follow that meaning wherever it leads in a particular case, no matter who the particular parties are. They are based on a rigorous, intellectually honest approach to the law. In this way, he honors and protects our most cherished principles for the long run.\nHe taught us all this as law clerks. But what he taught us about life — and what comes through loud and clear in the film — is to think for yourself and to decide for yourself. Exercise your God-given right to intellectual freedom. Don’t let anybody tell you who you have to be, or what you have to believe. Even if it doesn’t always make you popular, you will be true to yourself.\nThose in the mainstream media unfortunately often overlook this amazing legal legacy and his personal story. Thankfully, \"Created Equal\" captures the justice’s life and honors his legacy as one of the most thoughtful and important jurists of all time.\nThe film, which is now in select theaters across the country, is living history. I encourage everybody to go see it.\nCLICK HERE TO GET THE FOX NEWS APP\nYou will laugh, you will cry, and you will come away inspired to forge your path, even when things seem stacked against you. And to those of you who think you already have all the answers, I challenge you to go see the movie and hear for yourself what he has to say. Then make up your own mind.\nThat’s a right enjoyed by every American; a right Justice Thomas fights for every day.", "url": "https://www.foxnews.com/opinion/clarence-thomas-legacy-admire-helgi-walker"}