{"authors": ["Tim Graham"], "date_download": "2020-05-12 03:28:27", "date_modify": "2020-05-12 03:28:27", "date_publish": "2020-05-08 15:40:22", "description": "CBS has been preparing a miniseries based on former FBI Director James Comey's memoir, pompously titled \"A Higher Loyalty.\"", "filename": "opinion_comey-hero-hollywood-fantasy-collapses_1589254107.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/comey-hearing3.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_comey-hero-hollywood-fantasy-collapses_1589254107.html", "title": "Tim Graham: Comey the hero -- Hollywood's fantasy collapses", "title_page": "Tim Graham: Comey the hero -- Hollywood's fantasy collapses | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "If the \"first rough draft of history\" in the news media sounds dubious, the second draft made by Hollywood will almost certainly be worse. I'm not talking about documentaries, which can be judged as journalism. I'm talking about movies and TV shows, which will inevitably be pressed to dramatize things so they are evermore loosely \"based on real events.\"\nCBS has been preparing a miniseries based on former FBI Director James Comey's memoir, pompously titled \"A Higher Loyalty.\" In the memoir, he lectured, \"Ethical leaders choose a higher loyalty to those core values over their own personal gain.\" But the personal gain was sweet for Comey.\nFirst came the high-roller book deal with 850,000 copies, heavily promoted by all the Democrat-repeating networks. In Comey's case, that included an hourlong prime-time ABC \"news\" special during which he was interviewed by that nonpartisan George Stephanopoulos.\nEX-ACTING AG MATTHEW WHITAKER: DOJ'S FLYNN DECISION GOOD START BUT THERE'S MUCH MORE TO DO\nThe book sold like hotcakes to Trump haters. Add some more millions for his optioning the book to Hollywood for \"entertainment.\"\nProduction was slated to begin last November, but there's no word if it was anywhere near done before the coronavirus pandemic kicked in. Apparently, CBS Television Studios hasn't even decided where this Heroic Comey miniseries will land, either on Showtime or the CBS All Access streaming service, where it would be an easy match with the network's Trump-trashing drama \"The Good Fight.\"\nComey will be played by Trump-hating actor Jeff Daniels, who recently made the New York media swoon by starring as heroic lawyer Atticus Finch in \"To Kill a Mockingbird\" on Broadway.\nThe miniseries director, Billy Ray, said Daniels was picked because he had \"instant integrity, loads of warmth, intelligence, complexity and gravitas.\" That's obviously how they expect to portray Jim Comey: as another heroic lawman on the actor's resume.\nRay promised he would make a \"fair, responsible and comprehensively documented account of real-life events,\" CBS said in a press release. But current events are intruding on Comey's memoir and his picture of a heroic and nonpartisan FBI battling a president with no respect for the rule of law.\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\nFor example, new documents have surfaced that purport to show the FBI agents who investigated President Donald Trump's former national security adviser Michael Flynn sought \"to get him to lie\" so they could \"prosecute him or get him fired.\"\nDoes that sound nonpartisan?\nComey bragged to MSNBC's Nicolle Wallace in 2018 that he flouted the usual protocols for interviewing a top White House official. Usually, the White House counsel is contacted and an interview is carefully arranged.\nIn this case, Comey just sent in his agents, the ones scheming to \"prosecute him or get him fired.\" Former Comey aide Josh Campbell admitted in his own memoir that Comey said, \"We just decided, you know, screw it.\"\nFlynn didn't see the attack coming. He said sure and did the FBI interview -- without a lawyer present. He walked right into shark-infested waters and lied to the sharks, turning his life upside down.\nAttorney General William Barr has decided to vacate Flynn's conviction, finding the adventurous FBI interview was \"untethered to, and unjustified by, the FBI's counterintelligence investigation into Mr. Flynn.\"\nCLICK HERE TO GET THE FOX NEWS APP\nI think we can guess the CBS miniseries will glide right over the latest developments to keep its focus on Heroic Comey, no matter how much that narrative is collapsing. It's likely the series will be the latest in a line of conservative-smearing historical dramas aired by CBS/Showtime, from the Clarence Thomas-whipping \"Strange Justice\" to \"The Reagans.\"\nBut CBS -- the Dan Rather network -- lectures the rest of us to stop spreading disinformation.\nCLICK HERE TO READ MORE FROM TIM GRAHAM", "url": "https://www.foxnews.com/opinion/comey-hero-hollywood-fantasy-collapses"}