{"authors": ["C.J. Pearson"], "date_download": "2020-05-12 02:11:53", "date_modify": "2020-05-12 02:11:53", "date_publish": "2020-02-24 14:29:59", "description": "It’s time for conservatives to get tough and fight back against the liberal monopoly on higher education.", "filename": "opinion_c-j-pearson-conservative-students-should-join-me-in-rejecting-liberal-academias-intolerance_1589249513.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2020/02/Student-Campus.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_c-j-pearson-conservative-students-should-join-me-in-rejecting-liberal-academias-intolerance_1589249513.html", "title": "C.J. Pearson: Conservative students should join me in rejecting liberal academia's intolerance", "title_page": "C.J. Pearson: Conservative students should join me in rejecting liberal academia's intolerance | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "It’s time for conservatives to get tough and fight back against the liberal monopoly on higher education.\nThis month, I made the decision to decline an offer of admission extended to me by New York University. I announced my decision in a message on Twitter, which received more than 60,000 “likes” and 10,000 retweets. The reasoning behind my decision was simple: I couldn’t justify six-figure student-loan debt — paying tens of thousands of dollars each year — to enter an environment where some professors create an atmosphere hostile to the conservative values I hold and the politics I espouse.\nI didn’t come to this decision easily. NYU is a top-ranked university in a big city beaming with opportunity. That’s why I applied. But for all that drew me to NYU, I found myself increasingly pushed away by the treatment I might endure or the self-censorship I might be forced to adopt. Considering NYU’s decision to hire a professor who likened President Trump to Hitler, and to hire another whose group vandalized New York subways in support of anarchism, I have no desire to support NYU with thousands in tuition dollars.\nNYU COLLEGE REPUBLICANS CALL FOR FIRING OF LEFT-WING PROFESSOR WHO LED ANARCHIST PROTEST\nMany voices on the right have long decried academia for its left-leaning bias and lack of ideological diversity. These claims have merit. On campuses such as the University of California, Berkeley, conservative student activists have been sucker-punched in the face, and conservative speakers such as Ben Shapiro are routinely met with violent protests. Just this month, a mob of students surrounded pro-Second Amendment activist Kaitlin Bennett on the campus of Ohio University, where she was spat on, assaulted, and met with a barrage of derisive language.\nAccording to a study conducted by Brooklyn College, liberal professors outnumber conservative professors 10-1. Such ideological homogeneity spells real trouble for the state and quality of higher education. But for all the complaining conservatives have done about this very real issue, action to back it up has been far and in between.\nCLICK HERE TO GET THE OPINION NEWSLETTER\nAs conservatives, we:\nMake the choice to go deep into debt to attend institutions that are not tolerant of our beliefs;\nMake the choice to send our kids or to attend ourselves colleges and universities where we’ll be forced to self-censor and hide who we are;\nHave chosen for far too long not to fight back.\nWhy?\nBecause, we — as conservatives — have duped ourselves into believing that these colleges need us more than we need them.\nCLICK HERE TO GET THE FOX NEWS APP\nInstead of going to schools like NYU, conservatives should give consideration to institutions such as Hillsdale College and The King’s College. That’s not because these institutions are so-called “conservative colleges” — ideological safe spaces are never good — but because these universities recognize the importance of the free and fair exchange of different ideas. They recognize the importance of teaching students how to think rather than what to think. These days, institutions like these are few and far between.\nHigher education is a business, and we wield more power than we know. It’s time we use it.", "url": "https://www.foxnews.com/opinion/c-j-pearson-conservative-students-should-join-me-in-rejecting-liberal-academias-intolerance"}