{"authors": ["Matt Hammitt"], "date_download": "2020-05-12 01:57:06", "date_modify": "2020-05-12 01:57:06", "date_publish": "2020-02-28 12:25:58", "description": "As the father of a child with congenital heart disease, I find myself not only reflecting on the condition of my child’s heart but on the condition of my own heart as well.", "filename": "opinion_congenital-heart-disease-son-matt-hammitt_1589248626.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2020/02/Matt-Hammittcopy.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_congenital-heart-disease-son-matt-hammitt_1589248626.html", "title": "Matt Hammitt: How my son's congenital heart disease taught me a priceless lesson and made me whole", "title_page": "Matt Hammitt: How my son's congenital heart disease taught me a priceless lesson and made me whole | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "For most Americans, the highlight of February was Valentine’s Day. But as the cards are tucked away and the roses are beginning to wither, many remain unaware that American Heart Month is coming to end.\nI wish heart disease would come and go like Valentine’s Day, but it lives on without reprieve. As the father of a child with congenital heart disease, I find myself not only reflecting on the condition of my child’s heart but on the condition of my own heart as well.\nIt was in September of 2010, that my wife Sarah gave birth to our third child, a beautiful boy named Bowen. Although he looked perfect on the outside, he had a life-threatening heart defect called HLHS (hypoplastic left heart syndrome). He endured his first open-heart surgery at only five days old. Six months later, in February of 2011, he had another. Needless to say, Valentine’s Day wasn’t all kisses and candy for us that year.\nPAUL BATURA: WHAT IS HEROISM AND WHO IS A HERO?\nAs a fulltime musician, I had to go back on the road with my band while Sarah stayed home to care for our sick baby and two little girls. Life and marriage felt like winter for eighteen months. We were in crisis. Both of us were hurting, and we were grieving separately instead of together.\n“Can I survive this process any longer?” I asked myself. “Can I keep giving my heart to a child, to a marriage, that could break it?” I’m not proud to admit that I was so focused on my own pain. I wanted to be strong, but I became scared, depressed and self-protective. I shrunk back into the hurt and, emotionally, I found myself in a place where the light could barely break-in.\nCLICK HERE TO GET THE OPINION NEWSLETTER\nAs with any difficult season, it didn’t last forever. Life brought beauty and change, and I can see now what I couldn’t see then. God was teaching me the most important lessons in love while I was living out the hardest parts of my story. Ironic as it may be, he was using Bowen’s broken heart, and the pain that it had caused me, to make my heart whole again.\nBowen is nine now, and he had his third open-heart surgery last July. Our family still feels the pain, but as a husband and father, I know now how to use that pain to pull us together instead of apart.\nLewis, our youngest of our four kids, taught me the most valuable lessons about love through this process, when he looked at Sarah and said, “Mom, I’ve been thinkin’. Maybe I could cut my heart out and give it Bowen, ‘cause his is broken.”\nLewis taught me more than a lesson about opening up my heart, even when it hurts. He taught me how to give it away.\nCLICK HERE TO GET THE FOX NEWS APP\nAs American Heart Month comes to a close, I’m thinking maybe we could all live a little more like Lewis. Maybe we could take portion of that 20 billion dollars America spent on candy and cards this February and find a way to bless a child with a broken heart. Maybe we could do it in remembrance of the time our own heart was broken, and use our pain to help make someone else’s heart whole.\n“This is the very best way to love. Put your life on the line for your friends.” -- Jesus, John 15:13 (MSG)", "url": "https://www.foxnews.com/opinion/congenital-heart-disease-son-matt-hammitt"}