{"authors": ["Dan Gainor", "Dan Gainor Is The Vice President For Techwatch", "Business", "Culture At The"], "date_download": "2020-05-12 03:54:01", "date_modify": "2020-05-12 03:54:01", "date_publish": "2020-01-28 14:42:33", "description": "Three years into President Donald Trump’s first term and the news media still don’t understand how we got here.", "filename": "opinion_cnn-panel-trump-supporters-anchor-toxicity-dan-gainor_1589255641.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/Don-Lemon-cnn.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_cnn-panel-trump-supporters-anchor-toxicity-dan-gainor_1589255641.html", "title": "Dan Gainor: CNN panel mocks Trump supporters - Anchor who whines about 'toxicity' delivers just that", "title_page": "Dan Gainor: CNN panel mocks Trump supporters – Anchor who whines about 'toxicity' delivers just that | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Three years into President Donald Trump’s first term and the news media still don’t understand how we got here.\nSaturday, CNN Anchor Don Lemon show blasted Trump, his administration and his supporters. It was almost like CNN was trying its best to create a clip Trump could use in an ad to win his second term.\nThat meant Lemon, who last June said he might have to leave TV because of “toxicity,” laughed uproariously at his own toxic TV show. And the network that regularly complains about “hateful speech” by the administration, actually promoted the incident.\nCNN DON LEMON PANEL FACES INTENSE BACKLASH FOR MOCKING TRUMP SUPPORTERS AS ILLITERATE 'CREDULOUS RUBES'\nThe segment featured obnoxious anti-Trumper Rick Wilson. Wilson, who calls himself an “Apostate GOP Media Guy,” blasted the “boomer rube demo that backs Donald Trump.” The demented outburst went unnoticed for two days because so few people actually watched Lemon’s show. That meant it took till Monday for pushback.\nThe exchange began with Lemon asking about the dust-up between Secretary of State Mike Pompeo and NPR Host Mary Louise Kelly over Ukraine. That’s when Wilson went off on Trump and everyone else, saying “Donald Trump couldn't find Ukraine on a map if you had the letter ‘U’ and the picture of an actual physical crane next to it.”\nCLICK HERE TO GET THE OPINION NEWSLETTER\nThat’s about the time that journalist/anchor Lemon started laughing so hard he put his head on the desk as Wilson slammed the administration, as well. Wilson complained it was “playing to the base” and launched into a Southern drawl, mockingly saying: \"Donald Trump's the smart one — and y'all elitists are dumb!”\nThat was when Wajahat Ali, a New York Times Contributing Oped Writer and CNN contributor, joined in the mockery. Here’s the memorable exchange:\n“ALI: You elitists with your geography and your maps and your spelling!\nWILSON: Your math and your reading!\nALI: Yeah, your reading, you know, your geography, knowing other countries, sipping your latte!\nWILSON: All those lines on the map!\nALI: Only them elitists know where Ukraine is!”\nOn Monday, the firestorm began. Conservatives struck back at CNN and those involved, retweeting the video from several sources tens of thousands of times. The Daily Caller said, “America, this is what CNN thinks of you…” The Washington Examiner described it as: “CNN's Don Lemon and guests mock Trump supporters as uneducated and illiterate.”\nThe Federalist co-founder Sean Davis sarcastically tweeted: “I can’t tell if this is CNN or if it’s that episode on Trailer Park Boys where Bubbles tries to start his own public access channel TV show.”\nCLICK HERE TO GET THE FOX NEWS APP\nTrump himself retweeted a Daily Caller video of the segment, commenting: ”Don Lemon, the dumbest man on television (with terrible ratings!).” And WIlson took to Twitter to blast his critics. He summarized it as “‘Team “F--- Your Feelings’ is out in force today with their fake rage and their ‘duh elites hate u fer lovin’ Trump” piffle.’”\nIf Trump wins in November, he should send all three a nice “Thank you” note.\nCLICK HERE TO READ MORE FROM DAN GAINOR", "url": "https://www.foxnews.com/opinion/cnn-panel-trump-supporters-anchor-toxicity-dan-gainor"}