{"authors": ["Cal Thomas", "Cal Thomas Is America'S Most Widely Syndicated Op-Ed Columnist In The U.S. He Is The Author Of"], "date_download": "2020-05-12 04:46:46", "date_modify": "2020-05-12 04:46:46", "date_publish": "2020-03-06 15:03:24", "description": "Shame is something politicians in Washington abandoned long ago, but if it were to make a comeback, Schumer’s remarks would be at the top of a list of bad examples.", "filename": "opinion_chuck-schumer-supreme-court-cal-thomas_1589258806.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/cd4a4176-a358-45f9-b2e3-ab4377132bcc/bfa95add-8e8f-4653-8f99-4e4a0dd57e3a/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_chuck-schumer-supreme-court-cal-thomas_1589258806.html", "title": "Cal Thomas: Chuck Schumer abandoned shame with Supreme Court comments", "title_page": "Cal Thomas: Chuck Schumer abandoned shame with Supreme Court comments | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Just when you may have thought that the low quality of political rhetoric in Washington could not get any worse, along comes Senate Minority Leader Chuck Schumer, D-N.Y., to prove otherwise.\nAt a pro-choice demonstration outside the Supreme Court, which is considering a Louisiana law requiring doctors who perform abortions to have admitting privileges at nearby hospitals, Schumer delivered what sounded to many ears like a physical threat to two of the court’s conservative justices: “I want to tell you, (Neil) Gorsuch, I want to tell you, (Brett) Kavanaugh, you have released the whirlwind, and you will pay the price.”\nChief Justice John Roberts issued a rare statement in which he said of Schumer’s comments: “Statements of this sort from the highest levels of government are not only inappropriate, they are dangerous.” Schumer responded that Roberts is “biased.”\nKEVIN MCCARTHY: DEMOCRATS SHOULD RECONSIDER KEEPING SCHUMER AS SENATE LEADER\nAfter heavy criticism, including denunciations from liberals such as Harvard law professor Laurence Tribe, who called Schumer’s comments “inexcusable,” Schumer took to the Senate floor and offered a wimpy non-apology: “I should not have used the words I used yesterday. They did not come out the way I intended … I’m from Brooklyn. We use strong language.” He added he was in “no way” threatening the justices. He later “explained” he was talking about the price Republicans will pay at the polls if Gorsuch and Kavanaugh vote to uphold the Louisiana law.\nIf you watch the video, you see Schumer turning and pointing directly at the court building. It is difficult to accept either of his explanations.\nThe left regularly reminds us that words have consequences. They regularly condemn speech from conservative talk radio hosts they claim contributes to everything from racism to violence. But when they spew incendiary language it is fine with their fellow ideological travelers and much of the media. It’s good to be a Democrat.\nThere is a law prohibiting, among other things, verbal threats against federal officials. It is known in the legal community as 18 U.S.C. (United States Code) Section 351. It states that it is a felony to threaten “all Federal employees … when such threat is done with intent to impede, intimidate, or interfere with” such federal employee “while engaged in the performance of official duties, or with intent to retaliate against” such federal employee.\nSchumer’s comments clearly were meant to intimidate and even impede the court’s deliberations on the Louisiana law. Otherwise, why did he make them? His fiery remarks were not made on the Senate floor and thus he is not protected by the immunity enjoyed by senators.\nCLICK HERE TO GET THE OPINION NEWSLETTER\nSchumer also resurrected the “war on women” label that Democrats have used in the past, hoping, no doubt, to scare suburban women especially into voting for Democratic candidates.\nThe real war on women is coming from Planned Parenthood and the left. Since the Roe v. Wade decision in 1973, sixty-one million babies have had their lives snuffed out before taking their first breath. Some politicians are fine with allowing babies to be killed when they are fully viable, and even in some cases should they survive an abortion. Forty-one Democratic senators voted against the “Born Alive Act,” a bill that “would have required doctors to provide standard medical care to newborn infants who survive abortion procedures.” The bill did not win a necessary 60-vote majority in order to pass.\nCLICK HERE TO GET THE FOX NEWS APP\nNeither does one hear about the many women who have regretted their abortions and say they would have made a different choice had they seen a sonogram of their baby and been given more information about available alternatives.\nShame is something politicians in Washington abandoned long ago, but if it were to make a comeback, Schumer’s remarks would be at the top of a list of bad examples.\nCLICK HERE TO READ MORE FROM CAL THOMAS", "url": "https://www.foxnews.com/opinion/chuck-schumer-supreme-court-cal-thomas"}