{"authors": ["Nicole Saphier"], "date_download": "2020-05-12 05:11:00", "date_modify": "2020-05-12 05:11:00", "date_publish": "2020-03-03 19:30:30", "description": "When 1 in 5 deaths occur because of a poor diet, it is imperative to make some changes in the way we look at food.", "filename": "opinion_consider-plant-based-diet-nicole-saphier_1589260260.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/d7b9b667-76f5-4977-ba3d-33e3e9ca8728/b4fb2ab5-2eab-41ce-a743-3b60abdc59b7/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_consider-plant-based-diet-nicole-saphier_1589260260.html", "title": "Nicole Saphier: Should you consider a plant-based diet?", "title_page": "Nicole Saphier: Should you consider a plant-based diet? | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Should you consider a plant-based diet?\nThe moment someone mentions a plant-based diet half of the population is immediately disinterested. Why? Because they often equate a plant-based diet with Go Green initiatives and veganism.\nThat’s a shame.\nWHAT IS OAT MILK? AND IS IT HEALTHY?\nUnfortunately, the bad branding surrounding a diet that’s high in fruits and vegetables is keeping Americans from considering incorporating plant-based principles in their daily life.\nSeven of the top 10 leading causes of death in the United States are from chronic diseases. Eating a diet rich in fruits and vegetables reduces the risk of many of them including heart disease, type 2 diabetes, cancer, and obesity. Yet, an overwhelming majority of Americans are not consuming a plant-rich diet focused on staving off common diseases.\nSo, what is a plant-based diet and what is the hype surrounding this suddenly in vogue way of eating?\nPlant-based eating is a tangible, easy-to-achieve philosophical approach to better health. The key here is that it is inclusive rather than restrictive which promotes longevity in the diet.\nPlant-based eating is a tangible, easy-to-achieve philosophical approach to better health. The key here is that it is inclusive rather than restrictive which promotes longevity in the diet.\nThe reason why most fad diets fail is because, although they can be exhilarating at first, they ultimately require strict food omissions which prove difficult for many to maintain long-term. Whether you have tried lowering carbohydrates, counting calories or keto, oftentimes, people are left with cravings and wanting “more.”\nThe idea of a plant-based food regimen is that the more you add veggies and other plant-based foods to your plate, the less likely you are to fill the calories from less nutritious sources. Again, the concept is to promote inclusivity over exclusivity by incorporating foods that are as close to their original, natural state as possible in an effort to offset the processed foods.\nExamples of plant-based foods:\nVegetables: kale, spinach, cauliflower, potatoes, squash.\nWhole grains: brown rice, oats, quinoa, barley, farro.\nLegumes: peas, chickpeas, lentils, beans.\nTofu, tempeh.\nNuts and nut butters.\nFruits (not fruit juice)\nUnsweetened beverages: coffee, tea, water.\nUltimately what you decide to omit from your diet is entirely up to you. The goal is to eat less (not necessarily eliminate) unhealthy, processed foods from our diet while increasing healthier plant-based foods.\nFor the most part, people on plant-based diets eat less of the following:\nDesserts and sweetened beverages\nRefined grains: white rice, white bread, refined pasta, etc.\nPackaged foods: cookies, chips, sugary cereals, etc.\nProcessed meats: bacon, sausage, etc.\nAnd then there’s the big question: what about meat, seafood, eggs, dairy, and other fan-favorites?\nMany people get caught up in the idea that a “plant-based” diet means a vegetarian or vegan diet and that’s simply not the case.\nThe truth is plant-based can be whatever you want it to be. If you love red meat, then have a steak but cook it with less salt, use a plant-based oil if pan-frying and decrease the number of days you eat it.\nThe “everything in moderation” concept regarding red meat has even been proven through research.\nA 2014 study from the American Heart Association found that people who consumed daily quantities of processed red meat, like cold cuts, sausage, bacon, and hot dogs, had a 28 percent higher risk of heart failure.\nHowever, a study in the January 2017 American Journal of Clinical Nutrition found that eating 3 ounces of unprocessed red meat, three times per week, did not worsen blood pressure and total cholesterol levels.\nSimilarly, if you can’t live without cream in your milk, consider trying cashew milk, or another less sugary alternative. If that doesn’t do the trick, then drink your creamed coffee!\nIf the remainder of your diet is focused on eating nutrient-rich foods, then you can also have what you enjoy.\nThe goal is to decrease the less-healthy foods, which is much more achievable than eliminating them altogether.\nWith only 1 in 10 Americans eating the recommended amounts of vegetables and fruits, unless you are among the 10 percent of people eating enough (the odds are against you), any increase in plant-based consumption will be good for you.\nMany working Americans can find it difficult to eat nutritious foods during the day, myself included.\nHere’s what I do. I have incorporated preparing a Bento-box of sorts for myself each morning while preparing my kids’ school lunches.\nIn a multi-compartmental container, I place a mix of varying raw vegetables (sweet peppers, cucumbers, carrots, celery), fruit (blueberries, strawberries, apple, banana, tomatoes) and protein (almonds, peanuts, hard-boiled eggs, cooked meat).\nAs a snack at work, I will munch on nuts and maybe flavored seaweed sheets throughout the day while sipping on unsweetened hot tea (usually with turmeric).\nCLICK HERE TO GET THE OPINION NEWSLETTER\nThis consistent consortium allows me to have an occasional afternoon chocolate without harboring any of the guilt or consequences typically associated with a sugary indulgence.\nBottom line: eat more veggies, more often and whenever you can.\nYou don’t have to call your plan a “plant-based” diet if that term doesn’t sit right with you.\nAll Americans would benefit from more vegetables so you should make the effort to eat them, too.\nTry to do these things:\nEmphasize natural foods versus processed ones.\nFlip your portion sizes (decrease meats, increase vegetables).\nEat a salad or veggie-heavy soup before your main course.\nCook with plant-based oils (olive, sesame, peanut)\nDecrease the portion size of your sugary indulgences.\nCLICK HERE TO GET THE FOX NEWS APP\nWhen 1 in 5 deaths occur because of a poor diet, it is imperative to make some changes in the way we look at food.\nIt is not realistic to say you will never enjoy some of your favorite indulgences again. Instead, try to eat more healthily the majority of the time so that you can indulge occasionally while still working towards better health.\nCLICK HERE TO READ MORE FROM DR. NICOLE SAPHIER", "url": "https://www.foxnews.com/opinion/consider-plant-based-diet-nicole-saphier"}