{"authors": ["Chuck Devore", "Chuck Devore Is A Vice President With The Texas Public Policy Foundation", "Served In The California State Assembly To"], "date_download": "2020-05-12 02:41:08", "date_modify": "2020-05-12 02:41:08", "date_publish": "2020-02-16 14:42:57", "description": "The Lone Star State, the second-biggest Electoral College prize after California, may be a hard-fought political battleground this year.", "filename": "opinion_chuck-devore-will-illegal-voting-tip-texas-blue-in-2020_1589251268.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/texas-flag.png", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_chuck-devore-will-illegal-voting-tip-texas-blue-in-2020_1589251268.html", "title": "Chuck DeVore: Will illegal voting tip Texas blue in 2020?", "title_page": "Chuck DeVore: Will illegal voting tip Texas blue in 2020? | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Texas, the second-biggest Electoral College prize after California, may be a hard-fought political battleground this year.\nAfter Sen. Ted Cruz’ closer-than-expected 2.6 percent 2018 reelection victory over then-Congressman Beto O’Rourke, Democrats across the nation have been proclaiming Texas is theirs for the taking. Former New York Mayor Michael Bloomberg has pledged to spend $1 billion to defeat President Donald Trump, regardless of whether he wins the Democratic nomination for president. Texas could be in play. And if Texas goes blue, Trump’s path to victory narrows to a sliver.\nMillions of Bloomberg’s wealth have already gone to hire staffers in Texas and some of those staffers will be sorely tested to push Texas’ election laws to the breaking point. And past voting trends suggest that as much as 1.3 percent of the vote could be illegally cast, much of it with a push from aggressive campaigns.\nSALLY PIPES: DEMOCRATIC PRESIDENTIAL CANDIDATES WOULD ALL END PRIVATE HEALTH INSURANCE EVENTUALLY\nAnd while most Texas-based political analysts believe Trump will triumph in the Lone Star State, probably by a larger margin than his nine-point win in 2016, there is a push by Democrats to take the Texas state House and perhaps bolster their congressional numbers.\nAs part of the unfolding full-court press in Texas, some 1 million mail-in ballot applications were mailed out in January to voters by the state’s Democratic Party.\nAggressively banking absentee ballots is a key part of many election contests around the nation. For example, in California, where there are no restrictions on absentee ballots and voters can sign up for permanent vote-by-mail status, 65 percent of ballots cast in the 2018 general election were absentees.\nBut Texas isn’t California. Texas law restricts the use of mail-in ballots to those 65 and older, the disabled, people in jail, and those who will be out of the county on Election Day, such as members of the armed forces and college students.\nTexas voters have been increasingly using mail-in ballots, with absentee votes totaling a little less than 1 percent of votes in 2006, rising steadily to just over 6 percent in 2018.\nWell-funded and staffed campaigns love absentee voters because they can visit that voter multiple times to “encourage” them to fill out their ballot and turn it in. Sometimes campaign workers even “help” the voters to do so — though in Texas, that’s illegal unless the helper is a close relative. This is why campaigns mail absentee ballot applications to voters.\nIf recent trends continue, the Lone Star State will see a record number of mailed-in ballots in the 2020 general election — if 9.8 million people vote, then some 734,000 absentees are likely, with 20 percent of those cast by voters younger than 65.\nAn analysis of voters under age 65 who applied for mail-in ballots and voted from their home address — meaning they checked the “disability” box on the application form — shows that about 55,000 people claimed a disability to vote from home in 2018, up from about 8,600 in 2014.\nIf recent trends continue, the Lone Star State will see a record number of mailed-in ballots in the 2020 general election — if 9.8 million people vote, then some 734,000 absentees are likely, with 20 percent of those cast by voters younger than 65. That means an unprecedented 128,000 people may vote from home after claiming their “disability” makes it too difficult for them to get to the polls.\nA further analysis of these under-65 by-mail voters shows that many are college age, with about half being first-time voters. In other words — it is statistically improbable that most of them are, in fact, disabled. Thus, about 1.3 percent of the vote cast in Texas in 2020 could be by people who are not eligible to vote by mail according to Texas law.\nCLICK HERE TO GET THE OPINION NEWSLETTER\nIn 2018 during the March primary in Texas’ Rio Grande Valley, Starr County District Attorney Omar Escobar, a Democrat, became aware of a large number of applications to vote by mail that were made by voters claiming a disability. In this case, illegal vote harvesters were to blame. They had filled out the vote-by-mail application for the voters and had checked the “disability” boxes. Some of the vote harvesters were subsequently arrested and charged with election fraud.\nIn many instances though, county district attorneys either lack the resources or the will to prosecute election fraud. Thus, the state attorney general’s office must pursue charges against those who would attempt to win an election by cheating. In past years, the Texas Attorney General’s office had one lawyer assigned to election integrity. This cycle, Texas Attorney General Ken Paxton is expected to assign five prosecutors to help keep elections fair.\nThis effort is vital. A separate analysis by the Texas Public Policy Foundation showed an extremely high correlation between higher-than-expected use of mail-in ballots in 2018 and heavily contested campaigns for Congress and the state legislature. That election saw Texas Republicans lose two congressional seats, two state Senate seats, and 11 state House seats, with close calls in many others. To the extent mail-in ballots were improperly cast, some of those races might have gone the other way.\nCLICK HERE TO GET THE FOX NEWS APP\nTexas asks voters to show identification when they show up to vote. But voting by mail requires no such check. Further, Texas elections officials can’t question a voter who claims a disability to vote by mail. But law enforcement can pursue charges against those who lie on the vote-by-mail application, whether they’re illegal ballot harvesters or individual voters.\nWhile it is unlikely Texas will be in play at the presidential level in 2020, its congressional and legislative races will be battlegrounds. Any race within 1 percent is in danger of being won by fraud.\nCLICK HERE TO READ MORE BY CHUCK DEVORE", "url": "https://www.foxnews.com/opinion/chuck-devore-will-illegal-voting-tip-texas-blue-in-2020"}