{"authors": ["Deroy Murdock"], "date_download": "2020-05-12 04:50:16", "date_modify": "2020-05-12 04:50:16", "date_publish": "2020-03-06 12:20:27", "description": "How sad that Clint Eastwood, such a prominent and normally sensible figure on the right, opposes Trump because the president does not mirror Mr. Rogers.", "filename": "opinion_clint-eastwood-trump-deroy-murdock_1589259016.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8a09ad3c-92a0-47b5-ab80-6b59e94503fa/5071859d-31da-4d10-9615-c62132f1c7d3/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_clint-eastwood-trump-deroy-murdock_1589259016.html", "title": "Deroy Murdock: Clint Eastwood, please reconsider. Go ahead and let Trump make your day", "title_page": "Deroy Murdock: Clint Eastwood, please reconsider. Go ahead and let Trump make your day | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "The best thing we could do is just get Mike Bloomberg in there,” screen legend Clint Eastwood said February 21 in the Wall Street Journal. The actor and director’s comment raised eyebrows, especially coming from one of Hollywood’s few openly conservative luminaries. Eastwood, 89, told interviewer Tunku Varadarajan that he likes “certain things that Trump’s done” but wishes the president behaved “in a more genteel way, without tweeting and calling people names.”\nHow sad that such a prominent and normally sensible figure on the right opposes Donald Trump, not on policy differences, but because the president does not mirror Mr. Rogers.\nLike so many of those who oppose Trump’s style, Eastwood pines for a long-lost world.\nYes, Trump should use Twitter more selectively; he need not react to everything under the sun. And his name-calling often is counterproductive. But it is baffling for Eastwood, who backed Trump in 2016, to abandon him now over a lack of gentility. Like so many of those who oppose Trump’s style, Eastwood pines for a long-lost world.\nCLICK HERE TO GET THE OPINION NEWSLETTER\nPolitical gentility sounds lovely, but it should be a two-way street. Alas, Eric Holder, Obama’s attorney general, perfectly captured the attitude of today’s Left: “When they go low, we kick ’em. That’s what this new Democratic Party is about.”\nCLICK HERE TO GET THE FOX NEWS APP\nEastwood and others who share his concerns crave gentility, even as Democrats and their left-wing media allies call Trump a black-hating white nationalist who, as Resist Fascism’s Sunsara Taylor said on February 22, 2017, “could arguably be worse than Hitler.”\nCLICK HERE TO CONTINUE READING DEROY MURDOCK'S COLUMN IN THE NATIONAL REVIEW\nCLICK HERE TO READ MORE FROM DEROY MURDOCK", "url": "https://www.foxnews.com/opinion/clint-eastwood-trump-deroy-murdock"}