{"authors": ["James Jay Carafano"], "date_download": "2020-05-12 01:49:23", "date_modify": "2020-05-12 01:49:23", "date_publish": "2020-04-14 16:34:46", "description": "At the most critical moments of the response, the U.S. uniformed services have been there.", "filename": "opinion_coronavirues-us-military-helps-bend-curve-james-carafano_1589248163.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2020/03/02_GettyImages-1208644520.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_coronavirues-us-military-helps-bend-curve-james-carafano_1589248163.html", "title": "James Carafano: Coronavirus response - US military's crucial role in bending the curve", "title_page": "James Carafano: Coronavirus response — US military's crucial role in bending the curve | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\nHow do you see the military acting in the midst of a pandemic? Ask this question three months ago, and a lot of people — their imaginations fueled by “panic in the streets” movies and long-outdated stereotypes — would have predicted gas-masked troops lined up shoulder-to-shoulder, advancing with bayonet-tipped rifles to disperse crowds of desperate civilians.\nWell, THAT didn’t happen! Indeed, when historians write about the U.S. response to the coronavirus outbreak, they will note that the armed forces played a crucial role in turning the tide against the disease.\nThe military has jumped into the fight wholeheartedly. And I’m not just talking active duty and reserves. Even our veterans have joined in the fray.\nREP. BRIAN MAST: CORONAVIRUS — SPEAKER PELOSI, AMERICANS RISKING IT ALL ON THE JOB, CONGRESS SHOULD WORK TOO\nLate last month, the Army sent out a call to retired soldiers, particularly those in the medical field, asking them to voluntarily put their uniforms back on, leave their families and their livelihoods, and join in the fight against the \"invisible enemy.\" About 800,000 have answered that call, with more than 25,000 already back in harness. Some are now helping and healing in the heart of the hot zones.\nThat’s selfless service. Yet the kneejerk expectation that “military in action” means soldiers enforcing quarantines at gunpoint remains common. Why so?\nMuch of this mythology stems from actual events in the 1960s, when soldiers garbed in gas masks really did challenge civil rights and anti-war protesters at the point of a gun. Moviemakers soon appropriated this motif for horror movies. It was a staple of scary filmdom for a quarter of a century, from George Romero’s “The Crazies” (1973) to Dean R. Koontz’s “Phantoms” (1998).\nCLICK HERE TO GET THE OPINION NEWSLETTER\nYears ago, the University of Delaware Disaster Research Center found that most popular impressions of how people respond in disaster come from watching disaster movies. No surprise, then, that the image of armed soldiers marching against their own citizenry still lives in the popular imagination.\nIn real life, thankfully, the military's primary purpose in every disaster is to aid, serve and protect. When Lt. Gen. Russ Honoré stepped in to manage the post-Katrina hurricane response, one of his first actions was to order the troops involved in relief efforts to carry no weapons. This made clear that the soldiers weren’t there to intimidate or occupy. They were simply there to help.\nThus far, the military response to the coronavirus outbreak has consisted largely of deploying elements of the Army National Guard — individuals with civilian occupations who don their uniforms only when training or called up to active duty. In most cases, the federal government pays the troop salaries and operating costs, but the troops operate under the command of the state adjutant generals, who serve under their governors.\nThus, the state or territory determines the missions assigned to the forces, be it setting up COVID-19 testing stations, delivering meals to nursing homes or maybe even sometimes enforcing laws as directed by state or local civil authorities.\nAmerica’s men and women in uniform have worked with their civilian brothers and sisters to take care of our communities.\nBut the National Guard isn’t the whole story of America's military response to the virus. Virtually every branch is conducting various support missions, from the \"air-bridge\" flying personal protective equipment and other medical supplies into the U.S., to the temporary hospitals built by Army Corps of Engineers, to the Navy hospital ships now anchored in New York and Los Angeles.\nIndeed, at the most critical moments of the response, the U.S. uniformed services — which include the Public Health Services — have been there. They have delivered medical equipment and supplies, medical personnel, support manpower and logistical aid to the hottest hot spots — often help by providing the extra capacity needed to keep the civilian response from being overwhelmed. Without them, we might have seen medical systems crash and the contagion taking a much more gruesome toll.\nCLICK HERE TO GET THE FOX NEWS APP\nSome authoritarian regimes have used their militaries like sledgehammers to enforce quarantines and to isolate those they deem to pose a danger. But America’s men and women in uniform have worked with their civilian brothers and sisters to take care of our communities.\nIn many ways, those who say we weren't prepared for this pandemic speak out of ignorance. For decades the U.S. has honed its disaster response system — and always with a large role carved out for the military. Trained and ready to take action, they’ve made a huge difference in the war on COVID-19.\nCLICK HERE TO READ MORE BY JAMES CARAFANO", "url": "https://www.foxnews.com/opinion/coronavirues-us-military-helps-bend-curve-james-carafano"}