{"authors": ["Deroy Murdock"], "date_download": "2020-05-12 03:15:39", "date_modify": "2020-05-12 03:15:39", "date_publish": "2020-03-24 07:55:26", "description": "The coronavirus pandemic is not a re-run of 2008, when Washington rescued companies and people who deliberately did stupid, reckless things.", "filename": "opinion_congress-coronavirus-economic-threat-deroy-murdock_1589253339.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/bf6a2062-519b-418a-a2f1-fee1c1e487d9/107943d1-dd56-49b0-a5dd-d8812eb1bfc2/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_congress-coronavirus-economic-threat-deroy-murdock_1589253339.html", "title": "Deroy Murdock: Congress must fight coronavirus economic threat with backstops, not bailouts", "title_page": "Deroy Murdock: Congress must fight coronavirus economic threat with backstops, not bailouts | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "“In negotiations for economic crisis relief, some are pushing for a special carve-out just for Boeing & GE,” Senator Ted Cruz, R – Texas, complained Saturday via Twitter. “That would be WRONG. Millions are losing jobs; we don’t need bailouts or corporate welfare — those companies should participate in the same liquidity programs as everyone else.”\nSenator Cruz is right. The economic response to COVID-19 should involve backstops, not bailouts.\nStaunch free-marketeers like Cruz rarely advocate government help for business. Under normal circumstances, this would be as startling as watching Cruz demand tax hikes. But, of course, these circumstances are light-years from normal.\nDEFENSE SECRETARY MARK ESPER: IN CORONAVIRUS FIGHT, US MILITARY IS ON THE FRONT LINES\nThe COVID-19 global pandemic has turned thriving cities into ghost towns, as denizens hide indoors. (As I write these words in my East Village apartment, Manhattan sounds like Montana. My neighborhood’s motorcycles, garbage trucks, buses, screaming lunatics, feuding lovers, and drivers blasting music — and never the good kind — all have been stilled…by germs.)\nThis quietude echoes the suddenly silenced economy: Bars, restaurants, hotel ballrooms, amusement parks, airplanes, and the entire Las Vegas Strip are padlocked.\nCOVID-19 is not a re-run of 2008, when Washington rescued companies and people who deliberately did stupid, reckless things. Americans signed mortgages that they couldn’t afford, loaned to borrowers who couldn’t repay, and bundled dodgy debt into tranches of securities that amplified this wobbliness.\nWhen the entire McMansion of cards collapsed, Uncle Sam rushed in to nurse those who crashed on the wrong side of moral hazard. Renters and others who avoided such tomfoolery got stuck with the bill.\nToday’s crisis does not flow from irresponsible behavior. This time, Americans minded their own business, created jobs, worked hard, and thrived.\nSuddenly, like a bowl of egg drop soup fumbled onto our collective lap, COVID-19 roared out of China as its Communist leaders covered up the contagion for precious weeks. This disease soon ravaged Italy, marched across Europe, and infected the U.S., too.\nThrough no fault of their own, Americans now find themselves terrorized, not by Al Qaeda or ISIS, but by microbes.\nEven worse, they are impoverished, as the Dow Jones Industrial Average on Monday afternoon surrendered all of the gains since Donald J. Trump’s election.\nSo, under these circumstances, emergency government assistance is philosophically tolerable. But, as Cruz argues, it must be done right.\nFirst, special interest goodies should be sehr verboten. In a withering speech on Monday afternoon, Senate Majority Leader Mitch McConnell, R-Ky. identified several of the irrelevancies over which Democrats are filibustering the Phase III medical and financial-relief measure on which some 330 million Americans are waiting.\n“Here are some of the items on the Democratic wish list, over which they choose to block this legislation,” McConnell said on the Senate floor. “Tax credits for solar energy and wind energy. Provisions to force employers to give special new treatment to Big Labor. And listen to this: New emissions standards for the airlines.”\n“Are you kidding me?” McConnell asked in astonishment. “Democrats won’t let us fund hospitals or save small businesses unless they get to dust off the Green New Deal.”\nMcConnell called this “a left-wing episode of ‘Supermarket Sweep’” and denounced House Democrat whip James Clyburn of South Carolina for saying last week: “This is a tremendous opportunity to restrict things to fit our vision.”\nSecond, rather than such advantage-taking ugliness, the American people deserve legislation that relies far more on backstops, guarantees, and loans than handouts and gifts.\nClub for Growth president David McIntosh’s advice, once again, is worth heeding: “Club for Growth issued a series of policy options and recommendations, and the first said that any financial rescue of industry should be in the form of government loans, even if the interest is zero, and not as grants or bailouts.”\nWashington should offer embattled airlines, hotels, restaurants, movie theaters, and other corporations five-year, interest-free loans, which would carry these limited-but-crucial strings: These taxpayer dollars must be used to:\nPay wages and keep employees on staff\nPurchase mission-critical supplies and pay vital operating expenses, such as rent, utilities, and marketing\nConversely, no federal funds for bonuses or luxury items\nA violation of any of these rules would make these loans due within one year, with the national-average credit-card-interest rate added to the principle.\nThird, tax relief should be part of the equation.\nCLICK HERE TO GET THE OPINION NEWSLETTER\nCompanies should be excused from all corporate taxes on revenue in the first two quarters of 2020, provided they follow the same rules for loans above. Furthermore, immediate expensing of business purchases should be made permanent.\nFor employers and employees alike, President Trump’s proposed payroll-tax holiday makes tremendous sense.\nFourth, Fox News host Steve Hilton wisely suggests that the federal government indemnify commercial insurers to pay business-interruption insurance, provided that they accept COVID-19 as a reason to pay claims. If so, private companies could invoke such policies and get paid quickly by private insurers who are so equipped.\nFifth, small businesses should be welcome to all of these benefits and should be encouraged to capitalize on the ample borrowing opportunities created by the Federal Reserve’s enormous expansion in lending capacity.\nAs much as possible, these steps would allow American workers to stay employed and get paid by their employers, not Congress. This will make it far easier for shuttered enterprises to maintain their staffs through this crisis and then mobilize them, once COVID-19 has coughed off into the sunset.\nRelief via paychecks lets workers keep their dignity and maintain their morale. Also, the jobless rate would remain relatively low, while a spike in that metric would sink consumer and business confidence and speed the economy’s dance around the drain.\nCLICK HERE TO GET THE FOX NEWS APP\nSixth, additional federal payments to individuals should be targeted and temporary, not Washington’s usual waterfall of cash.\nLimited government may be too much to ask in this totally unforeseen calamity. But limiting unlimited government is as vital as ever to America’s long-term health.\nCLICK HERE TO READ MORE FROM DEROY MURDOCK", "url": "https://www.foxnews.com/opinion/congress-coronavirus-economic-threat-deroy-murdock"}