{"authors": ["Colin Reed", "Colin Reed Is A Former Campaign Manager For Massachusetts Scott Brown", "A Republican Strategist."], "date_download": "2020-05-12 03:33:00", "date_modify": "2020-05-12 03:33:00", "date_publish": "2020-02-01 00:29:14", "description": "Republicans should pay attention to the political threat of an authentic populist running on a policy platform he is very comfortable defending, and who voters are gravitating toward.", "filename": "opinion_colin-reed-sanders-take-seriously-trump-lessons-2016_1589254380.html", "image_url": "https://media2.foxnews.com/BrightCove/694940094001/2020/01/28/694940094001_6127189435001_6127191878001-vs.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_colin-reed-sanders-take-seriously-trump-lessons-2016_1589254380.html", "title": "Colin Reed: GOP, take Bernie seriously - don't forget these lessons from Trump in 2016", "title_page": "Colin Reed: GOP, take Bernie seriously – don't forget these lessons from Trump in 2016 | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Quick pop quiz, name the political candidate: a brash outsider who barges into a presidential primary with an angry change message pledging to upset the apple cart and root out the establishment class. Backed by an ardent and loyal group of supporters, this candidate ignores naysayers and defies expectations while vanquishing more experienced politicians. While their policy positions are dismissed as too outside the mainstream, they continue to rise in the polls in their slow and steady takeover of a political party they haven’t always (or still don’t) count themselves a member.\nIf you guessed Donald Trump in 2016, you’d be correct. Another acceptable answer: a certain Sen. Bernard Sanders, I-Vt., this time around.\nDon’t believe the professional left’s “nothing to see here” mentality toward the Vermont socialist’s rise. As we sit here in the hours before the Iowa caucus, Sanders has opened up a small yet durable lead in the Hawkeye State, according to RealClearPolitics. From there, the race shifts to New Hampshire, where Sanders enjoys a hometown advantage and the memory of his 22-point primary drubbing over Hillary Clinton four years ago. Next up, Nevada, where voters will caucus to make their voices heard. Four years ago, Sanders ran away with caucus states, winning 12 of them to Clinton’s two.\nHILLARY CLINTON SAYS BERNIE SANDERS DIDN'T DO ENOUGH TO UNITE DEMOCRATS IN 2016\nWant further evidence other Democrats are starting to feel the \"bern\" about Bernie’s chances? Look at the political attacks he’s taking, and just as importantly, where they are coming from. The barbs are flying in from all sides. From the left, Massachusetts Sen. Elizabeth Warren’s, D-Mass., choreographed attempt to portray Sanders as a sexist didn’t slow his surge. Warren waited too late to separate from Sanders, perhaps gambling he would fade away on his own. Right now, that looks like a losing bet.\nFrom the center, former New York City Mayor Michael Bloomberg recently took aim at Sanders’ socialist identity, while outside groups on all sides of the ideological aisle have begun plastering the Iowa airwaves with anti-Sanders messages. Meanwhile, Clinton continues to take potshots at her former rival, stating that “nobody likes him” in a highly publicized interview.\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\nEven the right-of-center Club For Growth is getting in on the act, turning heads with an ad highlighting Sanders’ age and, perhaps in an attempt to prop him up, comparing him to Franklin Delano Roosevelt. More on that later.\nWhat lies ahead? It’s possible the left’s fervor to oust Trump propels former Vice President Joe Biden to a narrow victory in Iowa. It’s also feasible that political gravity catches up to Sanders, and his weakness among key voting demographics of the Democratic primary sinks him when the contest heads south to Biden’s stronghold in South Carolina.\nBut it’s also within the realm of possibility to see Sanders taking the first three contests and becoming a runaway train. That “Big Mo,” as President George H.W. Bush coined it, can be impossible to stop once it gets rolling. That’s where another useful lesson from recent history can be indicative.\nRepublicans may be licking their chops at the idea of a general election race against Bernie Sanders. So too were Democrats when it became clear Donald Trump was going to be the GOP standard-bearer in 2016.\nCLICK HERE TO GET THE FOX NEWS APP\nIf Sanders becomes the nominee, maybe socialism will drive swing and suburban voters back to Trump. The astronomical price tag of his policy proposals and his unabashed plans to expand the federal government into almost every aspect of Americans’ lives may be too much to stomach.\nBy the same token, Republicans would be wise to take seriously the political threat of an authentic populist running on a policy platform he is very comfortable defending, and who voters are gravitating toward. Democrats didn’t take that threat seriously four years ago, and they’re still wishing they did.\nCLICK HERE TO READ MORE BY COLIN REED", "url": "https://www.foxnews.com/opinion/colin-reed-sanders-take-seriously-trump-lessons-2016"}