{"authors": ["Robert Garrett", "Robert C. Garrett Is Ceo Of Hackensack Meridian Health", "New Jersey S Largest Health Network With Hospitals", "More Than Patient Care Locations."], "date_download": "2020-05-12 04:48:39", "date_modify": "2020-05-12 04:48:39", "date_publish": "2020-04-26 16:08:26", "description": "New Jersey’s first COVID-19 patient entered our hospital in early March and the last six weeks have been unlike anything I’ve experienced in nearly four decades in health care.", "filename": "opinion_coronavirus-6-lessons-jersey-hospital-front-lines-robert-garrett_1589258919.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8876e180-ea89-45d9-8272-4c3d10e3cd20/1ef6d959-3b51-49c3-bd08-31fc49e210a8/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_coronavirus-6-lessons-jersey-hospital-front-lines-robert-garrett_1589258919.html", "title": "Robert Garrett: Coronavirus - 6 lessons from a New Jersey hospital system on the front lines", "title_page": "Robert Garrett: Coronavirus – 6 lessons from a New Jersey hospital system on the front lines | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\nNew Jersey’s first COVID-19 patient entered our hospital in early March and the last six weeks have been unlike anything I’ve experienced in nearly four decades in health care: an unending loop of intensely ill patients; urgent calls for more ventilators and surgical masks; ICU nurses holding up iPads to dying patients so families could say good-bye.\nFor the first time since this scourge upended our world, with New Jersey’s caseload surging at a staggering rate of 24 percent a day at its peak, the number of cases is slowing. Thankfully, in New Jersey we hit a milestone last week: there are now more hospital discharges than new admissions.\nWe are far from declaring victory, however, as our front-line heroes continue to battle this ferocious pandemic and our courageous patients continue to fight for their lives.\nNEWT GINGRICH: WE CAN RETURN TO A PRE-CORONAVIRUS ECONOMY – HERE'S HOW\nBut as one of the hardest-hit health networks in the country, we have already learned so much, so quickly. And it is incumbent upon all of us to remember those lessons and apply that life-saving knowledge now and in the future.\nFirst, stay home. It really works. I applaud the governors who mandated strict policies to break the back of this beast. We must remain vigilant to save lives.\nIf you think you’re invincible, consider the case of Michael Goldsmith, a 34-year-old father of two who spent a hellish three weeks on a ventilator at one of our hospitals, fighting for his life. He returned to his family on Sunday, a “walking miracle,’’ as his wife told the media who reported his homecoming. For the first time in more than a month, his young daughter curled up on his chest and fell asleep. Michael’s survival grants all of us hope and fortifies our care teams as they continue the fight.\nSecond, we quickly learned to delay intubating patients and putting them on ventilators. Whenever possible, we found it beneficial to place patients on their bellies – what’s known as \"proning\" – to better expand lung capacity and simultaneously deliver highly concentrated oxygen. It’s too early to produce peer-reviewed studies, but there’s enough anecdotal evidence to seriously consider the practice.\nThird, make a robust acquisition and conservation plan for Protective Personal Equipment (PPE) for the weeks and months ahead. If there’s one thing we learned, today can look radically different from tomorrow. If you are part of a larger health network, take advantage of that by marshaling supplies to the hardest-hit areas. If you are a stand-alone provider, find new partnerships and leverage that power.\nA nurse from one of our southern hospitals volunteered to be deployed to Hackensack, the epicenter of the pandemic in New Jersey. When she saw what her colleagues were up against, that day of help turned into a 200-mile roundtrip daily commute.\nAs a 17-hospital network, we have the advantage of maintaining and replenishing vital supplies and deploying them effectively. For example, we instituted a universal masking policy for both staff and patients to ensure the safety of all. Additionally, we have the option of better managing patient volume. We transferred COVID patients from isolated treatment areas to other hospitals in our system less taxed by the pandemic.\nFourth, understand that your teams are not inexhaustible. I have been in awe of our teams’ stamina and dedication. A nurse from one of our southern hospitals volunteered to be deployed to Hackensack University Medical Center, the epicenter of the pandemic in New Jersey. When she saw what her colleagues were up against, that day of help turned into a 200-mile roundtrip daily commute. She couldn’t bear the thought of leaving behind the critically ill patients or her colleagues in such a relentless storm.\nEven though we appear to be hitting a plateau, we are planning staffing six weeks out because our teams will need a break. They are experiencing trauma and it is incumbent upon all of us to provide counseling and needed care for these warriors. This is priority one.\nFifth, in a crisis, communication is vital. Every day, we are witnessing exceptional leadership from our health experts at daily briefings: they are factual, empathetic and a model of fortitude.\nIn our network, we are keeping 7,000 physicians and 36,000 front line and support teams apprised of daily developments: the number of patients in our hospitals; changes in essential policy from CDC that have moved at breakneck speed; important information on quarantining and benefits.\nAdditionally, we hold weekly webinars and virtual town hall meetings so that team members have access to our clinical and executive leadership, including me. In fact, I am rounding at our hospitals and facilities to see first-hand the heroic efforts of our care teams and leaders.\nCLICK HERE TO GET THE OPINION NEWSLETTER\nAnd lastly, remember that hope is essential to our survival. There’s a beautiful quote from Martin Luther King Jr. I’ve been thinking of so much these days: “Only in the darkness can you see the stars.’’\nIn the midst of our searing pain and unspeakable tragedies, we also are bearing witness to a glorious constellation: a global celebration of health care workers; unbowed nurses and doctors who return to the front line because it is what they were put on Earth to do, and the birth of the next generation who will one day hear stories of valor, loss and survival in the age of the coronavirus pandemic.\nCLICK HERE TO GET THE FOX NEWS APP", "url": "https://www.foxnews.com/opinion/coronavirus-6-lessons-jersey-hospital-front-lines-robert-garrett"}