{"authors": ["Curtis Hill", "Curtis Hill Is Indiana S Attorney General."], "date_download": "2020-05-12 01:54:11", "date_modify": "2020-05-12 01:54:11", "date_publish": "2020-02-29 16:09:30", "description": "We are experiencing a point in our national history when we desperately need the reminder that we are a stronger nation when we as a people respect one another despite our differences.", "filename": "opinion_clarence-thomas-thurgood-marshall-indiana-attorney-general-hill_1589248451.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2020/02/Thurgood-Marshall-Clarence-Thomas-Biography-REUTERS.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_clarence-thomas-thurgood-marshall-indiana-attorney-general-hill_1589248451.html", "title": "Indiana Attorney General Hill: What Thurgood Marshall, Clarence Thomas can teach us about being Americans", "title_page": "Indiana Attorney General Hill: What Thurgood Marshall, Clarence Thomas can teach us about being Americans | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Of the 114 individuals who have served as justices on the U.S. Supreme Court, only two have been African-American.\nThurgood Marshall was a liberal.\nClarence Thomas is a conservative.\nCURTIS HILL: WHY GEORGE WASHINGTON IS THE PRESIDENT WHO TOWERS OVER ALL OTHERS IN STATURE AND IMPORTANCE\nBut each rose from humble beginnings, overcame racial discrimination and made giant contributions to the causes of freedom and justice in America.\nTheir stories, taken together, prove yet again that we Americans ultimately share common goals across our ideological and political divides.\nCertainly, we are experiencing a point in our national history when we desperately need the reminder that we are a stronger nation when we as a people respect one another despite our differences.\nI’m a conservative, but despite the generally liberal worldview embraced by Marshall, I remain eternally grateful for his work not only as a judge but as a civil rights champion in preceding years.\nAs an NAACP lawyer, Marshall won 29 cases before the U.S. Supreme Court in the 1940s and 1950s. One of those victories came in the landmark Brown v. Board of Education case, which established in 1954 that states could not racially segregate public schools. That ruling overturned the shameful 1896 precedent, Plessy v. Ferguson, which allowed state-sponsored segregation so long as authorities strove for “separate-but-equal” facilities.\nFollowing his years as a lawyer, Marshall in 1961 was appointed to become a federal appeals judge by President Kennedy. Then, in 1965, he was named the nation’s first black U.S. solicitor general by President Johnson. Two years later, LBJ nominated Marshall to serve on the U.S. Supreme Court.\nAs a justice, Marshall defended states’ use of affirmative action — the policy of giving preference to minority applicants in college admissions and employment.\n“For it must be remembered,” he wrote in 1978, “that, during most of the past 200 years, the Constitution as interpreted by this Court did not prohibit the most ingenious and pervasive forms of discrimination against the Negro. Now, when a state acts to remedy the effects of that legacy of discrimination, I cannot believe that this same Constitution stands as a barrier.”\nWe are experiencing a point in our national history when we desperately need the reminder that we are a stronger nation when we as a people respect one another despite our differences.\nConservatives decry Marshall’s penchant for “judicial activism” on this issue and others, and on this score they have a point.\nWhatever one’s views on abortion and capital punishment, for example, I disagree with Marshall’s findings that the Constitution guarantees a right to the former and forbids the latter.\nNevertheless, Marshall pushed America to examine its collective conscience, and he consistently labored to improve the lives and prospects of those who historically had been wrongly oppressed. His legacy as a freedom fighter should be appreciated by conservatives as well as liberals.\nLike Marshall, Clarence Thomas also fought for civil rights in the years before becoming a judge. He served as chairman of the Equal Employment Opportunity Commission from 1982 to 1990 before becoming a federal appeals judge in 1990 and joining the U.S. Supreme Court in 1991.\nIn his own battles for truth and justice, however, Thomas has opposed judicial activism at every turn. “Each time a judge sidesteps or manipulates the law to achieve his or her desired outcome,” Thomas recently said, “the rule of law suffers and is undermined and eventually compromised.”\nTo this end, Thomas has opposed the sort of quota-based affirmative action that Marshall supported, explaining that “reverse discrimination” is not the key to unlocking the door of opportunity for minorities.\n“In my mind,” Thomas once wrote, “government-sponsored racial discrimination based on benign prejudice is just as noxious as discrimination inspired by malicious prejudice.”\nCLICK HERE TO GET THE OPINION NEWSLETTER\nUnlike those who believe the Constitution’s meaning is flexible enough to change with the times — thereby allowing for modernized interpretations — Thomas rightly believes federal courts should always adjudicate cases based on the original intent of the text.\nWhen asked once at an Indianapolis luncheon about progressives’ belief that the Constitution is a “living, breathing document,” Thomas replied dryly, “Well, the copy I have is inanimate.\"\nWhile Marshall and Thomas represent different perspectives on such important matters, both have used their legal careers to fight for freedom — one fighting from the left, one fighting from the right.\nTaken together, their legacies both have made positive impacts upon U.S. jurisprudence. Both have worked to improve the lives of their fellow Americans by pursuing truth, justice and civic virtue.\nSpeaking in the context of foreign policy, President Kennedy once said, “Let both sides explore what problems unite us instead of belaboring those problems which divide us.”\nCLICK HERE TO GET THE FOX NEWS APP\nSuch wisdom could just as easily be applied domestically to America’s political discourse.\nBoth Marshall and Thomas have made lasting and profound contributions to the life of our nation. When we appreciate this reality, then perhaps we also can appreciate that Americans of quite different political viewpoints can work together for the common good.\nCLICK HERE TO READ MORE FROM CURTIS HILL", "url": "https://www.foxnews.com/opinion/clarence-thomas-thurgood-marshall-indiana-attorney-general-hill"}