{"authors": ["Johnny Jones", "Staff Sergeant Johnny", "Joey", "Jones", "Ret.", "Joined Fox News Channel As A Contributor In July"], "date_download": "2020-05-12 02:29:23", "date_modify": "2020-05-12 02:29:23", "date_publish": "2020-04-05 14:27:09", "description": "Having spent the last few weeks at home in quasi-quarantine with my family, I woke this morning with a sense of epiphany. I’ve been here before.", "filename": "opinion_coronavirus-advice-afghan-vet-johnny-joey-jones_1589250563.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/054c3f21-754c-4828-9556-5c73ca5add71/27abc4e8-2306-418d-a481-4968f670b8a2/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_coronavirus-advice-afghan-vet-johnny-joey-jones_1589250563.html", "title": "Vet, IED survivor Johnny 'Joey' Jones: Coronavirus - You will get through this, America. Here's how I know", "title_page": "Vet, IED survivor Johnny 'Joey' Jones: Coronavirus – You will get through this, America. Here's how I know | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\nFor weeks now, political leaders and media alike have framed this fight against coronavirus in the strongest of terms. We are at war. As President Trump tweeted, “I am now war time president.” Such a declaration is not an inconsequential one, and with it comes the worst enemy of all, fear.\nHaving spent the last few weeks at home in quasi-quarantine with my family, I woke this morning with a sense of epiphany. I’ve been here before.\nI’ve lived months on end in a repetitive cycle of monotony and uncertainty. I’ve lived without the comforts of restaurants, movie theaters, shopping malls, family gatherings, holiday celebrations or last-minute road trips.\nI’ve turned inanimate objects into gym weights, structured a daily schedule to keep my mind and body busy, and felt the constricting pain of going from free citizen to mission serving Marine.\nSEAN HANNITY: GOV. CUOMO, STOP DENYING NEW YORKERS HYDROXYCHLOROQUINE\nIn war you abide by one truth; seemingly needless discipline in things like exercise, social interaction and even entertainment are as critical as good hygiene or even ammunition when it comes to staying healthy and alive. Our minds can conquer when our bodies can’t.\nSo you get creative. You don’t accept limitations, you create adaptations. For us, that was makeshift volleyball nets and card games, for you it’s work from home and virtual happy hour.\nMy last deployment was to the deadliest parts of Afghanistan in 2010. And there too, was a silent, invisible and deadly enemy. You called them roadside bombs, we called them IEDs. Whatever their nomenclature, they gave no warning, and attacked us in indiscriminate places. Markets, streets and playgrounds were the battlefields, and their carriers looked just like the rest of the populous. They were invisible, evil and felt none of the pain they inflicted on us.\nWe survived them with personal protective equipment like ballistic glasses and bulletproof vests. We stayed 10 meters apart from one another at all times so that if one of us set off a bomb, it’d killed the fewest of us. We dealt with the constant swaying of opinions by our political and strategic leaders, even when they seemed to contradict themselves from one day to the next. But we had a mission, to keep one another safe and to make it back home, back to freedom and family.\nAs a veteran, a survivor of an IED and a grateful American let me tell you this: you will get through this.\nNow, a decade later my heart breaks as I see a similar experience afflicting my precious nation, here in our own homes. Coronavirus attacks with the same veracity and no less uncertainty as bombs hidden in the ground. For me, there is no solace in the fact I have seen such a thing before. Simply put, I chose to go to that fight for the explicit purpose of ensuring such a fight wouldn’t come home to you. I can’t help but feel a semblance of failure seeing my fellow Americans needlessly suffer.\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\nSo as a veteran, a survivor of an IED and a grateful American let me tell you this: you will get through this. The fear and pain will subside and in its place a renewed appreciation for your freedoms and safety. Like you’ve never known.\nYou’ll be emotionally stronger, physically more resilient and collectively a better version of the greatest people on earth. Your memories of death and unfairness will be replaced by memorials of fearless sacrifice and common heroism. You’ll sleep better at night knowing we can endure because we do it together.\nYou’ll know first hand what I’ve known now for so long. Americans don’t just survive tragedies of this kind, we thrive after them.\nCLICK HERE TO GET THE FOX NEWS APP\nAs a veteran, my role in this is simple, to show you the way. To let you know it’s possible and to give any and everything I have to offer to help you through it.\nGod bless those struggling with this illness, our front line medical workers saving lives by risking theirs, our first responders and military, the people who keep the lights and water running, and the people who keep our hearts full with hope and love. But most of all, God bless the PEOPLE of the United States of America.\nCLICK HERE TO READ MORE BY JOHNNY \"JOEY\" JONES", "url": "https://www.foxnews.com/opinion/coronavirus-advice-afghan-vet-johnny-joey-jones"}