{"authors": ["Tammy Bruce"], "date_download": "2020-05-12 03:34:51", "date_modify": "2020-05-12 03:34:51", "date_publish": "2020-01-31 13:46:30", "description": "We are familiar with the contempt and hatred the establishment holds for the average American, yet it remains jarring to see such smug and comfortable arrogance on public display.", "filename": "opinion_cnn-outdoes-itself-with-arrogant-and-smug-ridicule-of-trump-supporters-tammy-bruce_1589254491.html", "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/don-lemon-CNN.png", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_cnn-outdoes-itself-with-arrogant-and-smug-ridicule-of-trump-supporters-tammy-bruce_1589254491.html", "title": "Tammy Bruce: CNN outdoes itself with arrogant and smug ridicule of Trump supporters", "title_page": "Tammy Bruce: CNN outdoes itself with arrogant and smug ridicule of Trump supporters | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "This column first appeared in the Washington Times.\nWell, that didn’t take long. The extraordinary display of bigotry and contempt for Trump voters presented by CNN’s Don Lemon and two guests — New York Times columnist Wajahat Ali and Republican ex-strategist Rick Wilson — aired Saturday night and went viral on social media with one video garnering more than 10 million views, and counting. And now it has been made into a very effective political ad by the GOP.\nDuring the segment, Mr. Wilson began to mock and dismiss President Trump and his supporters as illiterate “credulous boomer rubes,” who were too dumb to understand maps or much of anything else. At one point, Mr. Wilson affected what was supposed to be a Southern accent in a disgusting effort to further belittle conservative voters as idiots.\nFox News reported, “As Lemon began crying with tears of laughter, Wilson went on to depict what he thought a typical Trump supporter sounded like. ‘Donald Trump’s the smart one, and y’all elitists are dumb!’ Wilson said with a heavy Southern accent. ‘You elitists with your geography and your maps and your spelling!’ Mr. Ali chimed in during the mockery. ‘Your math and your reading!’ Mr. Wilson added. ‘All those lines on the map!’\"\nALAN DERSHOWITZ TEARS INTO CNN ON CNN: YOUR NETWORK 'DISTORTED' MY ARGUMENT TO 'MISINFORM VIEWERS'\nWe are quite familiar with the contempt and hatred the establishment holds for the average American. It’s one of the many reasons Mr. Trump was elected president. Yet it remains jarring to see such smug and comfortable arrogance on public display; importantly, however, it reminds us how deeply rooted this hatred and contempt really is.\nThe immediate reactions on social media were swift and clear. For example, Steve Krakauer, formerly of CNN and now of The Blaze, tweeted: “The arrogance, the dismissiveness, the smug cackling, the accents. If Donald Trump wins re-election this year, I’ll remember this brief CNN segment late one Saturday night in January as the perfect encapsulation for why it happened.”\nIvanka Trump, daughter and adviser to the president, responded: “You consistently make fun of half the country and then complain that it is divided. The arrogance, mocking accents and smug ridicule of this nation’s ‘Real Elites’ is disgusting.”\nMany predicted the segment would be turned into an ad for the GOP and Mr. Trump, and indeed it has. The ad intersperses the CNN panel ridicule and the now-infamous 2016 Hillary Clinton comment labeling Trump supporters “deplorables,” along with a variety of Democratic presidential candidates and media figures calling Trump supporters racist and dumb. It ends with Don Lemon laughing hysterically as his guests mock and insult the tens of millions of Americans who happen to disagree with them politically.\nThe ad ends with what may be the most effective call to action against the Democratic Party and its legacy media cohorts: “They think you’re a joke. Prove them wrong in November.”\nMr. Lemon finally came out with a statement about the debacle on Tuesday night. Predictably, it was terrible. Steve Krakauer reported on Twitter, ” ‘I don’t believe in belittling people,’ says @DonLemon tonight. ‘Just to make this perfectly clear — I was laughing at the joke, and not at any group of people.’ In other words, no apology, no introspection or humility, and an excuse that strains credulity. Disappointing.”\nWhether it be Mrs. Clinton, media personalities or miserable GOP has-beens, their hatred of people who disagree with them politically is more than an unthinking mistake, it’s a belief system. It’s one thing if someone is sitting at a bar with friends drinking (too much) and is caught on tape making outrageous statements. But this was a trio of men with extensive experience on national television and they were still deeply comfortable with ridiculing half the country with personal insults.\nYet our betters have told us every day, for years now, that’s it’s Mr. Trump who is an evil, bad man because he’s mean to people and devoid of personal decency. How interesting that it is always those accusing Mr. Trump who end up exposed as the hypocritical frauds.\nCLICK HERE TO GET THE OPINION NEWSLETTER\nMake no mistake: While the CNN segment is enraging, it’s not a one-off bad night for a few people in media. It is an example of the extent of the contempt the establishment has for the normals. No wonder the country had become a directionless economic dumpster fire, with insane terrorists rampaging freely around the world.\nThe arrogance, superiority and hatred for the average American now brought to light had to affect political decisions, policy approaches and foreign policy matters when their beloved bureaucracy was in charge. Just look at the 20 years leading to Mr. Trump’s election.\nCLICK HERE TO GET THE FOX NEWS APP\nWe were too generous with our benefits of the doubt, and 2016 finally offered an alternative to the abuse we had suffered as a nation for far too long.\nThe gift CNN has given the Republican National Committee is enormous. No longer will the GOP and Mr. Trump have to rely on telling you you’re despised by the establishment. Now, they can show you Mr. Lemon, Mr. Ali and Mr. Wilson confirm it themselves.\nCLICK HERE TO READ MORE FROM TAMMY BRUCE", "url": "https://www.foxnews.com/opinion/cnn-outdoes-itself-with-arrogant-and-smug-ridicule-of-trump-supporters-tammy-bruce"}