{"authors": ["Andrew Mccarthy", "Andrew C. Mccarthy Is A Senior Fellow At The National Review Institute", "A Contributing Editor Of National Review."], "date_download": "2020-05-12 02:36:00", "date_modify": "2020-05-12 02:36:00", "date_publish": "2020-04-03 10:56:38", "description": "Do we really think Congress is up to impeaching a president, and up to enacting emergency disaster legislation but needs a 9/11 Commission-style panel to investigate whether President Trump and his subordinates bungled COVID-19?", "filename": "opinion_coronavirus-9-11-commission-congress-andrew-mccarthy_1589250960.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8f8d121d-b8b3-44db-adfa-2a7c3d59f111/e6ad54eb-0884-4933-911b-6d7acd6bc5ef/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/opinion_coronavirus-9-11-commission-congress-andrew-mccarthy_1589250960.html", "title": "Andrew McCarthy: Coronavirus '9/11 Commission' is a political boondoggle. Don't let Congress pass the buck", "title_page": "Andrew McCarthy: Coronavirus '9/11 Commission' is a political boondoggle. Don't let Congress pass the buck | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\nHouse Speaker Nancy Pelosi has created a special committee to oversee the Trump administration’s coronavirus response. Does it show every sign of being an adjunct of the Joe Biden presidential campaign and a leftwing political crusade? Of course it does.\nAfter all, Pelosi placed in charge none other than Rep. James Clyburn, the senior South Carolina Democrat credited with single-handedly saving the Biden campaign when it seemed to be keeling over before the Palmetto State’s primary.\nThat would be the same James Clyburn who notoriously gushed that the coronavirus pandemic and the oceans of funding the federal government is pouring into our careening economy, presented “a tremendous opportunity to restructure things to fit our vision.”\nARI FLEISCHER: TRUMP'S CORONAVIRUS COMMUNICATIONS CHALLENGE – WHY THESE TWO THINGS ARE CRITICAL\nAll that said, though, Pelosi’s gambit illustrates that there is no good reason for Republicans to sign on to an even higher-profile boondoggle: a “9/11 Commission” for the coronavirus.\nPelosi has placed the design of this extravaganza in the capably partisan hands of Intelligence Committee Chairman Adam Schiff, D., Calif. Democrats see it as a cross between a jump-start for the moribund Biden campaign and stealth Impeachment 2.0.\nUnderstand: Elections have consequences. The Democrats won the House in 2018, and to the victor goes the spoils. That means all the committee chairs, the authority to form new committees and the subpoena power that comes with them. They have every right to conduct oversight, even if that power can be (and is apt to be) abused.\nDo we really think Congress is up to impeaching a president, and up to enacting emergency disaster legislation but needs a 9/11 Commission-style panel to investigate whether President Trump and his subordinates bungled COVID-19?\nAnd there must inevitably be congressional oversight of the executive branch’s response to the coronavirus pandemic. That includes oversight of the Trump administration’s management of the $2 trillion (and counting) relief package that is, by leaps and bounds, the priciest legislation in the history of the United States.\nIf the Republicans had control of the House, they too would be examining the administration’s performance; the way this game is played, such GOP scrutiny would be especially exacting if the White House were in Democratic hands.\nBut the point is that, in our system, it is Congress – the representatives politically accountable to voters – that is supposed to conduct oversight of the executive branch.\nIt is Congress that is supposed to convene hearings, grill executive officials, address abuses or incompetence and prescribe legislative fixes when they are needed.\nThose weighty constitutional responsibilities are not supposed to be delegated to unaccountable celebrity Beltway pillars gussied up into a bloviating blue-ribbon commission.\nDo we really think Congress is up to impeaching a president, and up to enacting emergency disaster legislation but needs a 9/11 Commission-style panel to investigate whether President Trump and his subordinates bungled COVID-19?\nCLICK HERE TO GET THE OPINION NEWSLETTER\nNaturally, Washington remembers circuses like the 9/11 Commission fondly because they are creatures of Washington. But in the event, the 9/11 Commission was a partisan experiment in mutually assured destruction, in which Democratic commissioners began by trying to show the Bush administration was too incompetent to recognize the terrorist threat, and Republicans countered by cataloging eight years of what it portrayed as Clinton administration futility in confronting violent jihadism.\nWhen the two sides finally wore each other out, the truce was that neither administration would be blamed, the intelligence agencies would be hung out to dry, and the silver-bullet solution would be drawn from page-one of the Capitol Hill Playbook: create two ever-bloating, prohibitively expensive, poorly performing bureaucratic behemoths: the Department of Homeland Security and the Office of the Director of National Intelligence.\nThe former was conceived as the perfect answer to what was framed as the 9/11 breakdown: the failure to share intelligence. Except … by the time it was finally created, DHS had no intelligence management role (the FBI having successfully clung to its turf in behind-the-scenes in-fighting). The new department became nothing more than an unwieldy home for a mishmash of federal agencies formerly housed in other bureaucracies – so Washington could say it skillfully redesigned the org chart.\nThe ODNI was even more ill-conceived: a seventeenth bureaucracy layered atop the existing alphabet soup of erratically performing intelligence agencies.\nIf your problem is the failure to share intelligence across sprawling government platforms, what better solution than to create still more sprawl? An agency the job of which could easily be done by the already existing leviathan that taxpayers underwrite to the annual tune of more than $50 billion.\nThe 9/11 Commission is no template. There is no good reason to reprise it for coronavirus. Congress should do its own work.\nCLICK HERE TO GET THE FOX NEWS APP\nIf the elected pols politicize that work, then that is exactly what it should look like to the American people – who can vote them out of office.\nLet’s not let our accountable elected officials pass the buck to a faux bipartisan panel of eminences that promises to be every bit as partisan … and to leave us with yet more sclerotic statism.\nCLICK HERE TO READ MORE FROM ANDREW McCARTHY", "url": "https://www.foxnews.com/opinion/coronavirus-9-11-commission-congress-andrew-mccarthy"}