{"authors": ["Brooke Singman", "Brooke Singman Is A Politics Reporter For Fox News. Follow Her On Twitter At"], "date_download": "2020-05-12 04:10:38", "date_modify": "2020-05-12 04:10:38", "date_publish": "2020-05-01 09:52:01", "description": "Republicans accused Joe Biden of “hiding documents” Friday after the former vice president, for the first time, personally denied the sexual assault allegation leveled against him by former Senate staffer Tara Reade but would not approve the release of Senate files under seal at the University of Delaware.", "filename": "politics_gop-accuses-biden-of-hiding-documents-after-denial-on-tara-reade-claims_1589256638.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/9c9cc576-86a2-4b3c-be07-9ebeacf30238/facc269e-9868-41dd-a085-c74ab22c8b08/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/politics_gop-accuses-biden-of-hiding-documents-after-denial-on-tara-reade-claims_1589256638.html", "title": "GOP accuses Biden of ‘hiding documents’ after denial on Tara Reade claims", "title_page": "GOP accuses Biden of ‘hiding documents’ after denial on Tara Reade claims | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Republicans accused Joe Biden of “hiding documents” Friday after the former vice president, for the first time, personally denied the sexual assault allegation leveled against him by former Senate staffer Tara Reade but would not approve the release of Senate files under seal at the University of Delaware.\n“The most transparent thing Joe Biden did this morning was admit that he is hiding documents so they can’t be used against him,” Republican National Committee Rapid Response Director Steve Guest said in a statement Friday, alleging a \"Biden coverup.\"\nBiden, during an interview Friday on MSNBC’s “Morning Joe,” adamantly denied Reade’s allegations, saying “unequivocally, it never, never happened and it didn’t. It never happened.”\nHe also said in a written statement that he's calling for a search of the National Archives to “identify any record of the complaint she alleges she filed and make available to the press any such document.” He maintained any such record would be kept by the Archives and not by the University of Delaware, which he said doesn't have \"personnel\" files.\nBut during the interview, Biden resisted suggestions that a similar search nevertheless be conducted at the university.\n“The fact is, that there’s a lot of things that of speeches I’ve made, positions I’ve taken, interviews that I did overseas with people, all of those things relating to my job,” Biden explained. “And the idea that they would be made public and the fact while I was running for public office, they could be really taken out of context.”\nBiden added: “The papers are position papers, they are documents that existed and that for example when I go, when I met with Putin or when I met with whomever. And all of that to be fodder in a campaign at this time.”\nThe GOP hammered Biden, saying he “is covering up his University of Delaware documents to save his political future.”\n“Not only did Joe Biden say his documents held at the University of Delaware ‘weren’t supposed to be revealed,’ (which is a lie) Biden admitted that he doesn’t want those records to see the light of day because they could be used against him or reveal what he said to Vladimir Putin,” Guest tweeted. “What?!”\nThe records from Biden’s more than three decades as a senator have come under increased scrutiny for days, as some in the press called on the nominee to push for the records’ release.\nREAD BIDEN'S FULL STATEMENT\nRepublican National Committee Chairwoman Ronna McDaniel also weighed in, saying Biden’s interview “only raised more questions about why he refuses to release his Senate records at the University of Delaware.”\n“His answers were nonsensical,” McDaniel said Friday. “What is he hiding?”\nMeanwhile, Biden was pressed on his past comments about women coming forward with allegations of sexual harassment and assault, specifically his comments surrounding the confirmation hearing of now-Supreme Court Justice Brett Kavanaugh.\nBiden said that “believing women means taking women’s claims seriously,” and added that “women have a right to be heard,” but that their claims should be investigated by the press.\nBIDEN OPERATIVES ACCESSED SECRET SENATE RECORDS AT UNIVERSITY OF DELAWARE BEFORE MID-MARCH, REPORT SAYS\n“They should start off with the presumption that they’re telling the truth,” Biden said Friday. “Then you have to look at the circumstances and the facts. And the facts in this case do not exist.”\nHe added: “Look at the facts and I assure you it did not happen. Period.”\nWhat viewers and voters were left with Friday were two accounts that were entirely at odds with one another.\nReade continues to claim that Biden sexually assaulted her in 1993 while she worked as a staffer in his Senate office.\nCounselor to President Trump Kellyanne Conway on Friday accused Biden of “silencing thousands of women,” saying his “confidence” makes it “very difficult for women to come forward.”\n“It’s different in our culture now,” Conway said. “Believe all women means all women, you don’t get to choose.”\nPresident Trump, too, has been accused by at least 18 women of sexual misconduct – which range from unwanted touching to sexual assault – during purported incidents occurring between the late 1980s up until 2013. He has also denied the allegations.\nFox News' Tyler Olson and Andrew O'Reilly contributed to this report.", "url": "https://www.foxnews.com/politics/gop-accuses-biden-of-hiding-documents-after-denial-on-tara-reade-claims"}