{"authors": ["Gregg Re", "Gregg Re Is A Lawyer", "Editor Based In Los Angeles. Follow Him On Twitter"], "date_download": "2020-05-12 03:12:01", "date_modify": "2020-05-12 03:12:01", "date_publish": "2020-02-06 15:31:44", "description": "The Trump administration's new suspension of Global Entry and other Trusted Traveler Programs (TTP) for New Yorkers is likely to affect some 800,000 people over the next five years, Customs and Border Protection (CBP) Assistant Commissioner, Office of Field Operations Todd Owen told Fox News on Thursday.", "filename": "politics_global-entry-new-yorkers-affected-ttp_1589253121.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1fd534d4-5161-4004-888f-9958595fe028/04260287-f1a3-490a-b938-a4a392f077c9/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/politics_global-entry-new-yorkers-affected-ttp_1589253121.html", "title": "Global Entry suspension to affect 800K New Yorkers over 5 years, 86K immediately, CBP official says", "title_page": "Global Entry suspension to affect 800K New Yorkers over 5 years, 86K immediately, CBP official says | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "The Trump administration's new suspension of Global Entry and other Trusted Traveler Programs (TTP) for New Yorkers is likely to affect some 800,000 people over the next five years, Customs and Border Protection (CBP) Assistant Commissioner, Office of Field Operations Todd Owen told Fox News on Thursday.\nApproximately 86,000 New Yorkers would be affected immediately, Owen said, including those with pending applications to join Global Entry and other TTP, and those up for renewal. People with current memberships in TTP would not be affected until their renewal dates.\nAffected TTP included Global Entry (which expedites entry into the U.S. from international destinations); NEXUS (Canada only); SENTRI (Canada and Mexico only); and FAST (quicker processing for commercial truck drivers entering or leaving the U.S.).\nActing Homeland Security Secretary Chad Wolf had announced exclusively on Fox News' \"Tucker Carlson Tonight\" Wednesday that DHS was suspending enrollment in several TTP for New York residents immediately in response to the liberal state's recently enacted sanctuary \"Green Light Law.\"\nIllegal immigrants rushed to New York Department of Motor Vehicles (DMVs) in large numbers after the \"Green Light Law,\" which allowed them to obtain driver's licenses or learner's permits regardless of their immigration status, took effect last December. The law also permitted applicants to use foreign documents, including passports, to be submitted in order to obtain licenses.\n'TUCKER' EXCLUSIVE: DHS CHIEF ANNOUNCES NEW GLOBAL ENTRY RESTRICTIONS\nIn a letter to top New York state officials obtained exclusively by Fox News, Wolf noted that the New York law prohibited DMV agencies across the state from sharing criminal records with CBP and Immigration and Customs Enforcement (ICE).\n\"In New York alone, last year ICE arrested 149 child predators, identified or rescued 105 victims of exploitation and human trafficking, arrested 230 gang members, and seized 6,487 pounds of illegal narcotics, including fentanyl and opioids,\" Wolf wrote \"In the vast majority of these cases, ICE relied on New York DMV records to fulfill its mission.\"\nThe law, Wolf went on, \"compromises CBP's ability to confirm whether an individual applying for TTP membership meets program eligibility requirements.\"\n\"This Act and the corresponding lack of security cooperation from the New York DMV requires DHS to take immediate action to ensure DHS' s efforts to protect the Homeland are not compromised,\" he said.\nOwen specified Thursday that that only New York DMV records contain accessible information concerning DUIs and aggravated traffic offenses, including misdemeanors and felonies, which have been necessary to vet applicants to TTP.\nDHS officials did not change TSA PreCheck eligibility because the \"Green Light Law\" did not affect it, Owen said. However, anyone with PreCheck through Global Entry will be affected, Owen confirmed.\nREAD THE DHS LETTER SUSPENDING GLOBAL ENTRY, OTHER TTPs FOR NEW YORK\nHe added that those people no longer eligible for TTP who had pending applications will receive refunds.\nThe DHS' sweeping order came a day after President Trump, in his State of the Union address, condemned left-wing states and local governments that \"release dangerous criminal aliens to prey upon the public,\" and called on Congress to pass a law establishing civil liability for sanctuary cities.\nWolf further warned that because the New York law \"hinders DHS from validating documents used to establish vehicle ownership, the exporting of used vehicles titled and registered in New York will be significantly delayed and could also be costlier.\"\nHe said DHS' assessment was ongoing and future enforcement action remained possible.\nResponding to the news late Wednesday, Rich Azzopardi, a senior aide to New York Gov. Andrew Cuomo, told CNN: \"This is obviously political retaliation by the federal government and we're going to review our legal options.\"\nAnd, New York Attorney General Letitia James on Thursday slammed the move as \"vindictive.'\nTRUMP, IN STATE OF THE UNION, TOUTS ICE AND SLAMS SANCTUARY CITIES\n\"Despite 13 other states and the District of Columbia already passing similar laws that allow undocumented immigrants to obtain driver licenses, the Trump Administration yesterday singled out and targeted New York State and its residents by informing the New York State DMV that New York residents could no longer enroll or reenroll in a number of Trusted Traveler Programs,\" James said, adding that the attorney general's office was removing the matter.\nDuring his State of the Union address, Trump explicitly called out New York's sanctuary policies.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Just 29 days ago, a criminal alien freed by the Sanctuary City of New York was charged with the brutal rape and murder of a 92-year-old woman,\" Trump said. \"The killer had been previously arrested for assault, but under New York's sanctuary policies, he was set free. If the city had honored ICE's detainer request, his victim would be alive today.\"\nFox News' \"Tucker Carlson Tonight\" investigative producer Alex Pfeiffer contributed to this report.", "url": "https://www.foxnews.com/politics/global-entry-new-yorkers-affected-ttp"}