{"authors": ["Tyler Olson", "Tyler Olson Covers Politics For Foxnews.Com. You Can Contact Him At Tyler.Olson Foxnews.Com", "Follow Him On Twitter At"], "date_download": "2020-05-12 03:43:42", "date_modify": "2020-05-12 03:43:42", "date_publish": "2020-03-18 07:45:19", "description": "The war of words between the Trump administration and China over the origin of coronavirus has escalated as President Trump is going out of his way to call it the \"Chinese Virus\" and China has embarked on a propaganda campaign to shift blame for the pandemic away from the Chinese Communist Party's handling of the crisis.", "filename": "politics_gloves-off-over-coronavirus-trump-administration-china-escalate-clash-over-origins_1589255022.html", "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/9f9c9edc-3cef-4025-addc-e6884b076840/0675edf8-60b8-48fd-9a33-ff3b1d7e7474/1280x720/match/image.jpg", "language": "en", "localpath": "C:\\Users\\Anke/news-please-repo//data/2020/05/11/foxnews.com/politics_gloves-off-over-coronavirus-trump-administration-china-escalate-clash-over-origins_1589255022.html", "title": "Trump unapologetically uses phrase ‘Chinese Virus’ as clash escalates with China over its origins", "title_page": "Trump unapologetically uses phrase ‘Chinese Virus’ as clash escalates with China over its origins | Fox News", "title_rss": "NULL", "source_domain": "foxnews.com", "maintext": "Get all the latest news on coronavirus and more delivered daily to your inbox. Sign up here.\nThe war of words between the Trump administration and China over the origin of coronavirus has escalated as President Trump is going out of his way to call it the \"Chinese Virus\" and China has embarked on a propaganda campaign to shift blame for the pandemic away from the Chinese Communist Party's handling of the crisis.\nThe escalation comes as the coronavirus pandemic continues to spread in the United States, shutting down sporting events, restaurants, bars and elections across the country.\n\"I always treated the Chinese Virus very seriously,\" Trump tweeted Wednesday morning, commenting on news coverage about his response to the pandemic -- one of three Wednesday morning tweets referencing the \"Chinese Virus.\"\nCORONAVIRUS: WHAT YOU NEED TO KNOW\nTRUMP TELLS PEOPLE OUT OF WORK OVER CORONAVIRUS THAT 'MONEY WILL SOON BE COMING TO YOU'\nMinutes earlier he tweeted: \"I will be having a news conference today to discuss very important news from the FDA [Food and Drug Administration] concerning the Chinese Virus!\"\nTrump also repeatedly called the pathogen, which causes a disease officially called COVID-19, the \"Chinese virus,\" in remarks at a White House coronavirus briefing Tuesday afternoon before doubling down Wednesday afternoon when asked about his terminology by a reporter, who commented, \"a lot of people say it's racist.\"\n\"Because it's from China. It's not racist at all, no. Not at all. It comes from China,\" Trump said. \"That's why. It comes from China. I want to be accurate.\"\nAlso in his Wednesday press conference, Trump declined to condemn an unnamed White House aide who, according to a CBS reporter, referred to the coronavirus as the \"Kung-flu.\"\nCORONAVIRUS CASES TOP 200,000 WORLDWIDE, DEATH TOLL PASSES 8,000\nAt nearly the same time Trump was speaking in his coronavirus briefing Tuesday, China moved to continue its propaganda war over the coronavirus by kicking out a subset of journalists from The New York Times, The Wall Street Journal and The Washington Post whose press credentials would expire before the end of this year.\n\"The Chinese Communist Party's decision to expel journalists from China and Hong Kong is yet another step toward depriving the Chinese people and the World of access to true information about China,\" the White House's National Security Council tweeted Tuesday in response to the decision.\nTRUMP ADMINISTRATION HITS BACK AFTER CHINA KICKS OUT US JOURNALISTS AMID CORONAVIRUS PANDEMIC\nSecretary of State Mike Pompeo has also stepped into the fray. On Monday he called People’s Republic of China Politburo member Yang Jiechi to push back on a tweet from the deputy director-general for the Chinese Foreign Ministry's Information Department. The deputy director-general, Lijian Zhao, tweeted that the United States military might be responsible for the coronavirus. He provided no evidence to that effect.\n\"Secretary Pompeo conveyed strong U.S. objections to PRC efforts to shift blame for COVID-19 to the United States,\" State Department spokesperson Morgan Ortagus said in a Monday statement. \"The secretary stressed that this is not the time to spread disinformation and outlandish rumors, but rather a time for all nations to come together to fight this common threat.\"\nTrump also addressed the topic Wednesday: \"As you know China tried to say at one point, maybe they stopped now, that it was caused by American soldiers. That can't happen. it's not gonna happen. Not as long as I'm president. It comes from China.\"\nThis comes as a variety of American officials continue to tailor their language around the coronavirus to call it the \"Wuhan virus\" or \"Chinese coronavirus\" over the objections of China and American liberals who have said that calling the coronavirus anything that indicates it is from China or Wuhan, the city in China where the virus is from, is racist.\nThat list includes Rep. Paul Gosar, R-Ariz., House Minority Leader Kevin McCarthy, R-Calif., Sen. Tom Cotton, R-Ark., and Pompeo himself.\nPOMPEO CONDEMNS CHINA'S 'EFFORTS TO SHIFT' CORONAVIRUS BLAME ON US IN CALL WITH COMMUNIST PARTY OFFICIAL\nZhao, whose job is essentially to spread propaganda for China's oppressive regime – which has detained between one and five million Uighur Muslims in \"re-education\" camps that are essentially forced labor or concentration camps – has been sharing glowing stories of China's global response to the coronavirus despite the fact the nation's lack of transparency during its initial spread contributed to the seriousness of the pandemic.\nAs early as last Wednesday Trump National Security Adviser Robert O'Brien was clearly assigning China with the responsibility for the coronavirus pandemic.\n\"Unfortunately, rather than using best practices, this outbreak in Wuhan was covered up,\" O'Brien said at the Heritage Foundation, a conservative-leaning think tank in Washington. \"There's lots of open-source reporting from China, from Chinese nationals, that the doctors involved were either silenced or put in isolation, or that sort of thing, so that the word of this virus could not get out. It probably cost the world community two months.\"\nZhao has also shared comments by Chinese Foreign Ministry Spokesman Geng Shuang saying American efforts to move its medical supply chain back from the communist nation are \"unrealistic and unhelpful\" after China hinted at reducing its medical exports to the U.S., plunging America into \"the mighty sea of coronavirus.\"\nSen. Josh Hawley, R-Mo., has introduced a bill in the Senate aimed at doing just that.\n\"We’re looking at potential shortages of up to 150 commonly prescribed antibiotics and anti-viral medications,\" Hawley explained on \"Tucker Carlson Tonight\" last month. \"That’s bad. The problem is in whole or in part, these drugs are made in China.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe White House and Congress are currently working on a stimulus package worth hundreds of billions of dollars for American workers and companies that have faced hardship due to shutdowns instituted to stem the spread of the coronavirus. The president sought to reassure them in a Wednesday morning tweet that the aid would start flowing soon — and that they are not the ones to blame for the pandemic.\n\"For the people that are now out of work because of the important and necessary containment policies, for instance the shutting down of hotels, bars and restaurants, money will soon be coming to you,\" Trump tweeted. \"The onslaught of the Chinese Virus is not your fault! Will be stronger than ever!\"\nFox News' Ronn Blitzer contributed to this report.", "url": "https://www.foxnews.com/politics/gloves-off-over-coronavirus-trump-administration-china-escalate-clash-over-origins"}